[
  {
    "id": 38,
    "ingredients": [
      "margarine",
      "egg",
      "flour",
      "salt",
      "pepper",
      "cauliflower",
      "butter",
      "onion",
      "spinach",
      "milk",
      "water",
      "cheese"
    ],
    "directions_list": [
      "stir",
      "salt",
      "separate",
      "drain",
      "mix"
    ],
    "directions_string": " Set the oven 375 °F. Boil the cauliflowers for 5-7 minutes in water and salt and drain. Boil the spinach for 5-7 minutes in water and salt and drain well. Sauté onion in butter, separate into two portions sautee cauliflowers with half of the onions. Spread them into baking pan or into an earth ware. Sauté spinach with the remaining half of onions for 6-7 minutes and add salt and pepper. Add flower and milk, stir them until the mix thickens. Take it off the heat. Add the beaten egg slowly and mix. Spread this mix over the cauliflowers in baking pan. Sprinkle grated kashar cheese over it. Bake it for 10-15 minutes. Serve it hot.",
    "category": "dinner"
  },
  {
    "id": 39,
    "ingredients": [
      "mint",
      "yogurt",
      "margarine",
      "salt",
      "pepper",
      "tomato",
      "garlic",
      "lamb",
      "onion",
      "beef",
      "water"
    ],
    "directions_list": [
      "sprinkle",
      "warm",
      "salt",
      "bread"
    ],
    "directions_string": " Cook the onion for a couple of minutes than add the ground meat and salt and black pepper. Stirring often, cook the meat.  Add tomato or tomatoes and cook for 5 more minutes. Set these aside; keep the lid on. Mix yogurt with garlic well, with a fork.  Keep it in room temperature. In a saucepan, sauté red pepper flakes in margarine, for 3 minutes. Warm up the bread in the oven for 5 minutes. On each dinner plate, place pita squares and sprinkle it with 2 tbsp. warm water right away; spread the sautéed meat over the bread.  Then spread some garlic yogurt on top. Pour over the sautéed red pepper to garnish. Sprinkle some mint on top. Serve hot.",
    "category": "dinner"
  },
  {
    "id": 45,
    "ingredients": [
      "milk",
      "green bell pepper",
      "salt",
      "oil",
      "green peppers",
      "tomato",
      "pepper",
      "peppers",
      "lamb",
      "onion"
    ],
    "directions_list": [
      "salt",
      "wash",
      "grill",
      "drain",
      "grate",
      "mix",
      "juice"
    ],
    "directions_string": "Cut meat into 2 cm. cubes. Peel, wash and grate the onions, drain the juice and mix it well with milk, olive oil, tomato paste, salt and black pepper. Refrigerate the meat in this mixture for 24 hours. Wash the vegetables, remove the stems of the peppers. Chop the peppers 2 cm. thick and the tomatoes into 2 cm. cubes. Pass the meat, pepper and tomatoes alternately over skews. Broil each side over charcoal fire or in an electric grill for 3–4 minutes, turning until all sides are broiled.",
    "category": "dinner"
  },
  {
    "id": 156,
    "ingredients": [
      "egg",
      "flour",
      "salt",
      "vinegar",
      "oil",
      "pine nut",
      "granulated sugar",
      "cucumber",
      "sesame oil",
      "green onions",
      "sesame salt",
      "green onion",
      "garlic",
      "mushroom",
      "beef",
      "water",
      "bamboo shoots",
      "sugar",
      "carrot"
    ],
    "directions_list": [
      "oil",
      "season",
      "sprinkle",
      "thin",
      "cut",
      "mix",
      "beat",
      "scald"
    ],
    "directions_string": "Remove the entails from the srimp. Insert toothpicks into the shrimps and scald them in boiling water; remove the shells. Cut the flesh into thin strips and mix with the salt, Granulated sugar or Sugar, and vinegar. Cut the Beef into strips, season itt with A ingredients and fry. Cut the carrott and cucumber into strips and sprinkle salt. Squeeze out the water and fry. Cut the bamboo shoots into strips and fry. Fry the beated egg and cut it into 2\" long strips. Scald and shared the bellflower roots finely. Fry in the sesame oil and mix them with the G ingredients. mix and beat the H ingredients till the batter is smooth. and make thin pancakes. Layer the pancakes in the center section of the 9-section dish topping each one with a little powdered pine nut. Then arrange the other 8 ingredients.",
    "category": "dinner"
  },
  {
    "id": 164,
    "ingredients": [
      "breadcrumbs",
      "cilantro",
      "chile",
      "lemon juice",
      "oil",
      "cucumber",
      "coriander",
      "chili sauce",
      "green onions",
      "chile peppers",
      "scallions",
      "chicken"
    ],
    "directions_list": [
      "brown",
      "oil",
      "drizzle"
    ],
    "directions_string": " Mix all ingredients, except oil, cucumber, and chile peppers or chile sauces. Wet hands, and take one tablespoon of ground chicken mixture and form into a meatball; repeat. Freeze the Thai-style meatballs overnight. Shallow-fry the meatball with the oil until they are brown and cooked through. Serve hot and plain or with other dishes. Top with the grated cucumber and lightly drizzle with the hot sauce or sweet chili sauce, if desired.",
    "category": "dinner"
  },
  {
    "id": 168,
    "ingredients": [
      "mint",
      "lime",
      "lettuce",
      "white pepper",
      "sweet rice flour",
      "coffee",
      "sugar",
      "granulated sugar",
      "lemon",
      "flour",
      "oil",
      "beef",
      "fish sauce",
      "cucumber",
      "lemongrass",
      "palm sugar",
      "sesame seed",
      "white sugar",
      "green onions",
      "serrano pepper",
      "sticky rice",
      "cornmeal",
      "tomato",
      "rice",
      "garlic",
      "lime juice",
      "shallot",
      "cabbage",
      "cherry tomato",
      "bibb lettuce",
      "greens",
      "scallions",
      "grape tomatoes",
      "water",
      "red onion",
      "spring salad mix",
      "glutinous rice",
      "spring mix"
    ],
    "directions_list": [
      "can",
      "serve"
    ],
    "directions_string": "Prepare a batch of Thai glutinous rice or sticky rice (aka Thai glutinous rice or sweet rice) to serve with this salad. '''Note:''' if you're in a hurry or on a budget, you can leave out the scallions, cucumber or cuke, tomatoes and lemon and this salad will retain its signature flavor.",
    "category": "dinner"
  },
  {
    "id": 209,
    "ingredients": [
      "lime",
      "cilantro",
      "light coconut milk",
      "corn",
      "oil",
      "fish sauce",
      "brown sugar",
      "sweet potato",
      "chile pepper",
      "coconut milk",
      "bananas",
      "curry",
      "potato"
    ],
    "directions_list": [
      "stir",
      "simmer",
      "heat",
      "slice",
      "brown",
      "mix",
      "juice"
    ],
    "directions_string": " In a large saucepan, heat oil. Add potatoes and cook until lightly browned on the outside. Add coconut milk, curry paste, juice of the lime, fish sauce, and brown sugar to pan, stirring to mix well. Cover and simmer for 15 minutes or until potatoes are tender, stirring occasionally. Peel and slice bananas into chunks and stir in with the potatoes. Cook over low heat 5–7 minutes or until heated through and bananas have softened but are still intact. Garnish with chopped cilantro and sliced chile pepper or chilli peppers before serving. Serve hot.",
    "category": "dinner"
  },
  {
    "id": 234,
    "ingredients": [
      "mint",
      "orange peel",
      "lamb",
      "coriander seed",
      "cilantro",
      "chilli",
      "salt",
      "rosemary",
      "oil",
      "cereals",
      "coriander",
      "pepper",
      "cardamom",
      "balsamic vinegar",
      "olive oil",
      "tomato",
      "garlic",
      "chile pepper",
      "spinach",
      "cherry tomato",
      "grain",
      "water",
      "mushroom"
    ],
    "directions_list": [
      "peel",
      "salt",
      "fry",
      "garnish",
      "trim",
      "oil",
      "heat",
      "blend",
      "grill",
      "cool",
      "sprinkle",
      "turn",
      "dice",
      "drain",
      "cut",
      "prepare",
      "juice"
    ],
    "directions_string": " Peel the parsnips, trim and shave into long strips. Fry in hot oil in a deep fryer til lightly golden. Drain briefly on paper, sprinkle with salt, then store airtight once cooled. (Can be kept up to 2 days) Split the cardamom pods and extract the seeds. Put half of them in a dish with 1 teaspoon of coriander seeds, the olive oil, garlic and orange peel and blend together to make a marinade. Add the lamb rumps, turn to coat in the marinade, then pepper to taste. Cover and leave a room temp for 1 hour. Grind the rest of the cardamom pods with the 1 tbsp of coriander seeds and set aside for the tomato jus. Mix the dried chillies and rosemary with 2 tbsp olive oil. Set aside for the mushrooms. Plunge the spinach into boiling water. Count to 30 and remove and drain with cool water. Drain again. Next prepare the sauce ingredients. Skin the tomatoes, cut in half flick the seeds into a sieve, set over a bowl to drain, then dice the flesh. Cool the marinaded lamb rumps on a very hot grill till done to your liking. Transfer the lamb to a board and sprinkle both side very generously with the salt. Leave to stand 2-3 minutes while preparing the garnishes. Put the chile pepper or chilli oil for the mushrooms in a small frying pan and set over a medium high heat. When hot add mushrooms. Cook quickly until lightly browned. Sprinkle with salt then tip onto a plate. While the mushrooms are cooking, heat a large oiled pan over a medium heat. Add the spinach, sprinkle on a little salt and add some ground pepper. Reheat gently, don't fry. Arrange on 4 dinner plates. Wipe out both fry pans. Put 1 tsp of oil in the small fry pan and set it over a med. High heat. When hot tip in the cherry tomatoes. Stir quickly and cook 20 seconds until glazed. Turn onto a plate. Warm the extra virgin olive oil in a fry pan. Add the ground spices then add the diced tomato and strained jus, a good splash of balsamic vinegar, ¼ ts of salt and the herbs. Warm through then turn off the heat. Slice the meat thinly across the cereals or grain and transfer to the plates. Spoon over the tomato juice and garnish with the tomatoes, mushrooms and parsnips. Serve immediately.",
    "category": "dinner"
  },
  {
    "id": 339,
    "ingredients": [
      "egg",
      "rye bread",
      "salt",
      "oil",
      "tomato",
      "green onion",
      "mustard",
      "onion"
    ],
    "directions_list": [
      "salt",
      "flip",
      "oil",
      "bread",
      "top",
      "brown",
      "beat"
    ],
    "directions_string": " Break the egg into a cup or small bowl and beat with a fork till the yolk and egg white is mixed. Put the salt in the egg mixture and stir. Cut tomato into slices. Cut up onion finely. Heat pan with oil in it on medium till oil starts to cook. Make sure the oil covers the entire pan. Pour egg mixture in pan and put the piece of bread on top immediately or it will not stick. Let it cook till the egg is golden brown on the one side and then flip it over. When the other side is crunchy as well take it out. Spread the mustard on the side of the bread with the egg on it. Add the remaining toppings and enjoy!. ",
    "category": "brunch"
  },
  {
    "id": 394,
    "ingredients": [
      "garlic powder",
      "cream",
      "chicken broth",
      "heavy cream",
      "salt",
      "thyme",
      "pepper",
      "onion",
      "leek",
      "celery seed",
      "potato"
    ],
    "directions_list": [
      "reduce",
      "boil",
      "mash"
    ],
    "directions_string": " Bring broth to a boil and reduce to medium. Add leeks, potatoes, and onion. Simmer, covered, 25–30 minutes. Add seasonings and cream. Simmer 5 minutes more. Slightly mash with a potato masher to desired consistency. Serve with salad and crusty bread.",
    "category": "dinner"
  },
  {
    "id": 400,
    "ingredients": [
      "garlic powder",
      "cheddar",
      "black pepper",
      "egg",
      "quick-cooking oats",
      "salt",
      "cooking spray",
      "oats",
      "pepper",
      "american cheese",
      "lentils",
      "tomato sauce",
      "parsley",
      "jack cheese",
      "tomato",
      "garlic",
      "quick oats",
      "basil",
      "onion",
      "swiss cheese",
      "water",
      "cheese"
    ],
    "directions_list": [
      "salt",
      "simmer",
      "cool",
      "turn",
      "mash",
      "top",
      "boil"
    ],
    "directions_string": " Add salt to water and boil in a saucepan. Add lentils and simmer covered 25 – 30 minutes, until lentils are soft and most of water is evaporated. Remove from fire. Drain and partially mash lentils. Scrape into mixing bowl and allow to cool slightly. Stir in onion, oats and cheese until mixed. Add egg, tomato sauce, garlic, basil, parsley, seasoning salt and pepper. Mix well. Spoon into loaf pan that has been generously sprayed with pam (non-stick cooking spray) or well-greased. Smooth top with back of spoon. Bake at 350 °F for 30 – 45 minutes until top of loaf is dry, firm and golden brown. Cool in pan on rack for about 10 minutes. Run a sharp knife around edges of pan then turn out loaf onto serving platter.",
    "category": "dinner"
  },
  {
    "id": 409,
    "ingredients": [
      "lettuce",
      "black pepper",
      "egg",
      "salt",
      "olives",
      "black olive",
      "pepper",
      "tomato",
      "garlic",
      "potato"
    ],
    "directions_list": [],
    "directions_string": " Mix all ingredients gently in a large bowl until well combined. Roll meatballs 1½ - 1¾\" in diameter. Heat about ¼\" of oil over medium heat in a large frying pan. Fry meatballs in oil, rolling frequently, until evenly browned and juices run clear. Drop meatballs in your favorite sauce and let simmer for awhile to flavor sauce or just serve with your favorite pasta and sauce. Tip: you can also bake or broil these if the frying part is too much of a hassle — I use my broiler pan if I bake them, so the fat drips down and away from the meatballs.",
    "category": "dinner"
  },
  {
    "id": 440,
    "ingredients": [
      "garlic powder",
      "black pepper",
      "cilantro",
      "egg",
      "salt",
      "hot pepper",
      "pepper",
      "parsley",
      "tomato",
      "garlic",
      "red pepper",
      "chili powder",
      "chile pepper",
      "onion",
      "water",
      "potato",
      "vegetable oil"
    ],
    "directions_list": [
      "fry",
      "garnish",
      "oil",
      "heat",
      "slice",
      "barbecue",
      "cut"
    ],
    "directions_string": " Wash the potatoes and cut them into two or three pieces apiece. Cook them in water about twenty minutes, or until they're pretty soft. Take them out of the water and allow the water on them to evaporate, then slice the potatoes into small chunks. Fry the onion in a few tablespoons of vegetable oil until it is tender. Add the potatoes and fry at a medium-high heat until browned, about ten or fifteen minutes. Add salt, pepper, garlic (optional) chili powder (optional) and chile pepper or hot pepper (optional) to taste. Serve with breakfast as a side to eggs, pancakes, waffles, or even cereal; and garnish with ketchup, barbecue sauce, salsa, lightly fried tomato wedges, cilantro, or parsley, if desired.",
    "category": "breakfast"
  },
  {
    "id": 561,
    "ingredients": [
      "black pepper",
      "belgian endive",
      "endive",
      "vinegar",
      "pepper",
      "balsamic vinegar",
      "olive oil",
      "mustard",
      "garlic",
      "spinach",
      "water",
      "radicchio"
    ],
    "directions_list": [
      "cut",
      "toss",
      "separate"
    ],
    "directions_string": "Wipe the Endive clean with a damp cloth. Cut off the root end and separate the leaves. Stack the leaves and cut them lengthwise into strips. Follow the same procedure for the radicchio and spinach.mustard Vinaigrette: Put the mustard, vinegar, tamari, garlic and pepper into a small bowl. Whisk with a fork. Slowly add the olive oil, stirring until blended. If the vinaigrette is too thick, add some water.Combine the lettuces and toss with the mustard vinaigrette. Arrange on each of four dinner plates.",
    "category": "dinner"
  },
  {
    "id": 594,
    "ingredients": [
      "celery",
      "bread",
      "salt",
      "pepper",
      "onion",
      "olive oil",
      "cinnamon",
      "snapper",
      "garlic",
      "onion",
      "grouper",
      "milk",
      "water",
      "annatto seed",
      "fish stock",
      "plantain",
      "potato"
    ],
    "directions_list": [
      "oil",
      "saute"
    ],
    "directions_string": "Heat the olive oil in a large, heavy casserole pot and add the garlic, sofrito paste, habanero pepper, Onion, celery, plantains, and the Potato and saute for 5 minutes over a medium heat, stirring, until the onions start to wilt.",
    "category": "dinner"
  },
  {
    "id": 692,
    "ingredients": [
      "bread crumbs",
      "oil",
      "curry powder",
      "sausage",
      "egg"
    ],
    "directions_list": [
      "warm",
      "fry",
      "oil",
      "bread",
      "drain",
      "bake",
      "mix"
    ],
    "directions_string": " Chop the hard boiled eggs and thoroughly mix with the stilton and curd cheese. Divide into 10 parts and shape into balls. Chill for 10–15 minutes. Mix the sausage and curry powder together. Divide into 10 pieces. Flatten each piece and wrap around a ball of filling. Seal the edges well. Roll in beaten egg then coat in bread crumbs. Deep fry in hot oil at 160 °C / 325 °F for 7–8 minutes and drain on absorbent kitchen paper, or place on a greased baking sheet and bake at 190 °C / 375 °F / gas 5 for 15–20 minutes, until cooked. Serve warm or cold.",
    "category": "brunch"
  },
  {
    "id": 726,
    "ingredients": [
      "salt",
      "rosemary",
      "white wine",
      "pepper",
      "garlic",
      "lamb",
      "water",
      "potato"
    ],
    "directions_list": [
      "cut",
      "dry",
      "top",
      "serve"
    ],
    "directions_string": "Prepare the potatoes and cut into slices. <br />Spread in a greased ovenproof dish and add water and white wine. <br />Season with salt, pepper, rosemary and garlic.<br />Rub the leg with salt, pepper, rosemary and halved cloves of garlic. <br />Place the leg of Lamb on top of the potatoes.<br />Place the dish in a preheated oven at 200° (390 °F).<br />Make sure the potatoes does not dry out, add additional water if they do.<br />Carve the meat and serve with the potatoes, a salad and some good bread.",
    "category": "dinner"
  },
  {
    "id": 745,
    "ingredients": [
      "black pepper",
      "bacon",
      "egg",
      "bacon grease",
      "salt",
      "pepper",
      "bacon fat",
      "butter",
      "onion",
      "milk",
      "potato"
    ],
    "directions_list": [
      "fry",
      "stir",
      "grease",
      "drain",
      "brown"
    ],
    "directions_string": " In a frying pan, fry the bacon until crisp. Remove and drain on paper towel. Remove the bacon grease or bacon fat from the frying pan, add the butter and saute' the onion until soft. Add the potatoes and brown lightly. Beat the eggs lightly and add the salt, pepper and milk, and finally the chopped bacon. Pour the egg mixture over the onions and potatoes and stir occasionally until cooked.",
    "category": "breakfast"
  },
  {
    "id": 777,
    "ingredients": [
      "garlic powder",
      "shortening",
      "egg",
      "onion powder",
      "flour",
      "salt",
      "oil",
      "beef",
      "tomato",
      "ground beef",
      "chili powder",
      "tomato paste",
      "milk",
      "worcestershire sauce",
      "baking powder",
      "lard"
    ],
    "directions_list": [
      "stir",
      "oil",
      "heat",
      "press",
      "sprinkle",
      "roll",
      "dough"
    ],
    "directions_string": " Mix flour, salt, and baking powder together in a bowl. Cut in shortening until it resembles crumbly meal. Gradually sprinkle in milk stirring until dough clings together. Knead 10 times. Let rest ½ hour. Mix ground beef with all the ingredients except tomato paste. Fry slowly in 1 tablespoon oil until cooked. Mash around a bit so it's crumbly. Add 1 to 2 tablespoons tomato paste (so that it's thick), stir very well. Turn off heat and let filling cool. Add as much hot sauce as you like. On a very well-floured surface, roll dough as thick as you would for pie crust (can divide it into 2 parts if desired). Cut 5\" circles (using any container with 5\" opening) and place filling on center of each circle. Brush beaten egg on lower edge of circles. Fold over and press edges with fork dipped in flour. Fry in lard about 2 minutes on each side until brown. Make sure there is enough lard to cover the empanadas — about 3 – 4\" deep. Can be frozen unfried. Stack between wax paper, sprinkling plenty of flour in between empanadas and wax paper, or they will stick together.",
    "category": "dinner"
  },
  {
    "id": 783,
    "ingredients": [
      "cheese",
      "lettuce",
      "velveeta",
      "pinto bean",
      "sour cream",
      "gourmandise",
      "black olive",
      "onion",
      "tomato",
      "beef",
      "water",
      "taco seasoning"
    ],
    "directions_list": [
      "can",
      "heat",
      "cream"
    ],
    "directions_string": "* Cook Beef and Onion in a large skillet, stirring until Beef crumbles and is no longer pink.* Drain.* Stir in 1 can chopped tomatoes, seasoning mix, and 3/4 cup water; cook over medium heat 10 minutes or until liquid evaporates.* Stir in pinto beans and Cheese; cook until Cheese melts. * Serve over shredded lettuce in tortilla salad shells with chopped tomatoes, sliced and sour cream toppings.=== Other Links ===== See also ==",
    "category": "dinner"
  },
  {
    "id": 898,
    "ingredients": [
      "cheese",
      "celery",
      "cabrales",
      "mahon cheese",
      "mahón cheese",
      "manchego cheese",
      "green olive"
    ],
    "directions_list": [],
    "directions_string": "Arrange crackers, cheeses, celery sticks and a dish of on a cutting board or large serving platter and set out for snacking as dinner cooks.This recipe yields 8 servings.",
    "category": "dinner"
  },
  {
    "id": 929,
    "ingredients": [
      "flour",
      "salt",
      "granulated sugar",
      "sugar",
      "heavy cream",
      "potato",
      "butter"
    ],
    "directions_list": [
      "warm",
      "peel",
      "chill",
      "roll",
      "mash",
      "mix",
      "dough"
    ],
    "directions_string": " Boil the potatoes without peeling, peel and mash while still warm and put into ricer. Add the remaining ingredients, mix well, cover and chill for 8 hours or overnight. Mix in ½ cup flour. Divide into 15-16 balls if you want dinner-plate size. Using a grooved rolling pin with sock, and pastry canvas, roll each ball out.  Use flour, and keep balance of dough in the refrigerator.  Bake each lefse on medium to hot griddle.",
    "category": "dinner"
  },
  {
    "id": 945,
    "ingredients": [
      "salt",
      "red-skinned potato",
      "pepper",
      "green cabbage",
      "potato",
      "mustard",
      "onion",
      "cabbage",
      "water"
    ],
    "directions_list": [
      "salt"
    ],
    "directions_string": " Cut cabbage into approximately ½-inch strips. Cut potato in small cubes. Slice onion. Place cabbage, potato and onion on a saucepan with 1½ cup water. Cook vegetables until potato is soft. Add salt and pepper or any seasoning of your choice.",
    "category": "lunch"
  },
  {
    "id": 974,
    "ingredients": [
      "horseradish",
      "black pepper",
      "celery",
      "vegetable stock",
      "sugar",
      "granulated sugar",
      "lemon",
      "chile",
      "salt",
      "sherry",
      "celery salt",
      "oil",
      "pepper",
      "olive oil",
      "tomato",
      "superfine sugar",
      "caster sugar",
      "vodka"
    ],
    "directions_list": [
      "salt",
      "oil",
      "slice",
      "puree",
      "cut",
      "brown"
    ],
    "directions_string": " Preheat oven to 400°F (200°C). In a large roasting pan, arrange tomatoes and chile cut side up. Sprinkle granulated sugar or sugar and some salt and pepper. Drizzle oil on top. Roast for 30 minutes or until brown on top. Transfer roasted tomatoes in a blender. Add a little stock. Puree until smooth. Put puree back in the pan. Add remaining stock and tomato puree. Stir over medium low heat, taking care not to let the mixture boil. Add horseradish, sherry and vodka. Add more seasoning if desired. To serve, place a celery stalk in a bowl and ladle over soup. Sprinkle some ground black pepper. Finish with a slice of lemon on top. ",
    "category": "dinner"
  },
  {
    "id": 1078,
    "ingredients": [
      "cheese",
      "cheddar",
      "apple",
      "lettuce",
      "powdered sugar",
      "cream cheese",
      "sugar",
      "granulated sugar",
      "vanilla extract",
      "chocolate",
      "whipped cream",
      "beef",
      "confectioner's sugar",
      "chicken",
      "cinnamon",
      "tomato",
      "mustard",
      "butter",
      "beef",
      "milk",
      "mayo",
      "strawberries",
      "chicken"
    ],
    "directions_list": [],
    "directions_string": " Soak cannellini bean or beans in 1 quart cold water the night before you plan to make soup. Next day, drain cannellini bean or beans and put aside. Put 2 quarts water in a large soup pot and in it cook bones and vegetables with salt over low heat for 2 hours. Strain and save liquid. Put drained cannellini bean or beans into the reserved liquid; add enough water to bring the amount back to 2 quarts. Cook covered over low heat till cannellini bean or beans are done. Make little dumplings and put aside. Melt the lard in a frying pan. Wilt onion in it, then mix in the flour and cook over very low heat till the mixture is light brown. Remove from heat and mix in mashed garlic and paprika. Whip in ½ cup cold water. Add to the almost ready bean soup and cook the soup over very low heat for at least 10 minutes longer.",
    "category": "lunch"
  },
  {
    "id": 1085,
    "ingredients": [
      "sugar",
      "granulated sugar",
      "vanilla extract",
      "margarine",
      "egg",
      "nondairy topping",
      "cherry",
      "whipped cream",
      "cooking spray",
      "cool whip",
      "egg whites",
      "cinnamon",
      "blueberry",
      "strawberry",
      "sourdough bread",
      "butter",
      "milk",
      "water"
    ],
    "directions_list": [
      "whip",
      "can",
      "heat",
      "simmer",
      "bread",
      "slice",
      "cool"
    ],
    "directions_string": " Mix the milk, egg whites, and cinnamon and/or granulated sugar or sugar together. Place both sides of each bread slice into the mixture to saturate the bread. Most of the time i use pam cooking spray to butter the pan, because it's easier and quicker for me to just spray every time to keep it from sticking. But if you prefer butter or margarine, that's fine too. The first slice you should cook for a few minutes on each side. Then with the other slices, after the pan has had a chance to really get hot, it only takes a couple of minutes each side to get it brown. Depending on how much of the milk and egg mixture you let sink into each slice, it can make from 4-8 sourdough slices. I like to use strawberry syrup, but you can use any syrup you like. You can even make your own syrup by mixing two cups of granulated sugar or sugar, one cup or water, a teaspoon of vanilla extract and whatever flavoring (strawberry, blueberry, cherry) you want. Bring it to a boil, then lower the heat and let it simmer for about five minutes. For thicker syrup, you can add clear karo syrup, too. And to finish it all off, you can add a couple of (big) spoonfuls of nondairy topping or cool whip (or any whipped cream) on top. Yummy. Enjoy!.",
    "category": "breakfast"
  },
  {
    "id": 1203,
    "ingredients": [
      "milk",
      "flour",
      "all-purpose flour",
      "salt",
      "baking powder",
      "sugar",
      "granulated sugar",
      "whole wheat flour",
      "egg",
      "butter"
    ],
    "directions_list": [
      "grease",
      "mix",
      "dough",
      "beat"
    ],
    "directions_string": " Preheat the oven to 400 °F. Lightly grease baking sheets without sides. Cream the butter with the granulated sugar or sugar.  Add the egg and beat until light. Stir the flours together with the baking powder and salt. Add to the creamed mixture along with the milk and mix until well blended. Divide the dough into 2 equal parts. Flatten each half of the dough and place one on each baking sheet. Sprinkle lightly with flour. Roll the dough out directly on the baking sheet until the dough is ¼ inch thick. Pierce all over with a fork. Cut into 2 x 3-inch rectangles, leaving them in place. Bake for 12 to 15 minutes. Cut the crackers where they were scored to separate, leaving them on the baking sheet. Return the crackers to the oven to crisp, about 10 minutes.",
    "category": "breakfast"
  },
  {
    "id": 1296,
    "ingredients": [
      "english muffin",
      "egg"
    ],
    "directions_list": [
      "cut",
      "top"
    ],
    "directions_string": " Dilute soup with ¾ cup water. Split muffins. Toast them, then cut each half into 8 wedges, trying to keep shape intact. Place ½ muffin in individual baking dish. Cover each with 2 pieces Canadian bacon. Make small hollow in center, break eggs into it. Spoon over top ½ cup mushroom soup mixture. Bake at 350 °F for 12 to 15 minutes. Eggs should be set, but not hard cooked. They will continue cooking a little after being removed from oven.",
    "category": "brunch"
  },
  {
    "id": 1302,
    "ingredients": [
      "baking soda",
      "egg",
      "all purpose flour",
      "flour",
      "salt",
      "oil",
      "butter",
      "baking powder",
      "vegetable oil"
    ],
    "directions_list": [
      "combine",
      "rise",
      "grease",
      "salt",
      "brush",
      "dry",
      "separate",
      "top"
    ],
    "directions_string": " Combine flour, baking soda, salt and baking powder. In a separate bowl combine eggs, oil. Mix well. Add starter to dry ingredients and mix. Transfer to a lightly floured surface and roll. Cut out biscuits and place on a lightly grease cookie sheet. brush top of biscuits with melted butter. Cover and let rise 30 minutes. Bake in a preheated 350 °F oven for 15 – 20 minutes.",
    "category": "brunch"
  },
  {
    "id": 1391,
    "ingredients": [
      "red bell pepper",
      "smoked sausage",
      "red peppers",
      "sausage",
      "oregano",
      "macaroni",
      "green peppers",
      "green onions",
      "green bell pepper",
      "broccoli",
      "cheese"
    ],
    "directions_list": [
      "heat",
      "stir",
      "mix"
    ],
    "directions_string": " Boil macaroni for about ten minutes. Drain and then stir in the pouch of cheese that comes in the box. Set aside. Cook sausage in a large skillet over medium heat for 6 minutes. Add vegetables and oregano. Cook until vegetables are tender. Add macaroni and cheese and mix lightly.",
    "category": "dinner"
  },
  {
    "id": 1397,
    "ingredients": [
      "cheese",
      "chili bean",
      "pasta",
      "macaroni",
      "onion",
      "green bell pepper",
      "green pepper",
      "tomato",
      "bell pepper",
      "water"
    ],
    "directions_list": [
      "heat",
      "stir"
    ],
    "directions_string": "* Cook the macaroni from the box and the additional macaroni. * Saute the Onion and green bell pepper or green pepper in water. * Add tomatoes and beans and heat through.* Sprinkle the Cheese powder over drained macaroni in a big bowl. * Stir to coat. * Mix in the hot bean mixture and stir well.",
    "category": "dinner"
  },
  {
    "id": 1492,
    "ingredients": [
      "bacon",
      "lemon juice",
      "water",
      "egg",
      "butter"
    ],
    "directions_list": [
      "combine",
      "heat",
      "grease",
      "serve"
    ],
    "directions_string": " Lightly grease skillet. Fill skillet half way with water. Bring water to boiling. Reduce heat and simmer. Break eggs into cup and carefully slide one at a time into water. Allow space for each egg. Simmer for 5 minutes. Meanwhile, heat Canadian Bacon in skillet. Remove poached egg and serve with Canadian Bacon and Hollandaise Sauce. For sauce, combine butter, egg yolks, water and lemon juice. Heat in a double boiler, stirring constantly.",
    "category": "brunch"
  },
  {
    "id": 1534,
    "ingredients": [
      "buckwheat",
      "blueberry",
      "water",
      "blueberries",
      "orange juice",
      "banana",
      "maple syrup"
    ],
    "directions_list": [
      "blend"
    ],
    "directions_string": "1. In a medium-size bowl, blend the pancake mix, water, and banana with an electric hand mixer.",
    "category": "breakfast"
  },
  {
    "id": 1550,
    "ingredients": [
      "apple",
      "orange peel",
      "golden delicious apple",
      "raisins",
      "cinnamon",
      "butter",
      "orange juice",
      "apricot jam",
      "allspice"
    ],
    "directions_list": [
      "toast",
      "warm",
      "heat"
    ],
    "directions_string": " Melt butter over medium heat in large nonstick skillet; add apple slices. Cook, tossing occasionally, about 10 minutes or until golden brown. Stir in remaining ingredients; cook, stirring, about 3 minutes until sauce thickens slightly. Serve warm over pancakes, waffles, French toast or hot breakfast cereal or cereal.",
    "category": "breakfast"
  },
  {
    "id": 1586,
    "ingredients": [
      "cheese",
      "black pepper",
      "celery",
      "grains",
      "margarine",
      "egg",
      "corn",
      "salt",
      "green bell pepper",
      "green pepper",
      "rice",
      "mushroom",
      "butter",
      "milk",
      "carrot"
    ],
    "directions_list": [
      "stir",
      "salt",
      "heat",
      "separate",
      "cut",
      "pour"
    ],
    "directions_string": " Cook celery, green bell pepper or green pepper and Mushrooms in butter in large skillet over medium-high heat. Combine eggs, milk, salt and black pepper in small mixing bowl. Reduce heat to medium and pour egg mixture over vegetables. Continue stirring until eggs are almost cooked, about 1 to 2 minutes. Add rice and stir to gently separate grains; heat thoroughly. Microwave Instructions: Heat margarine in 2- to 3-quart microproof baking dish. Add carrots, green bell pepper or green pepper and Mushrooms; cover and cook on HIGH 4 minutes. Combine egg whites, eggs, milk, salt and black pepper in smaill bowl; pour over vegetables. Cook on HIGH 4 minutes, stirring with fork after each minute to cut cooked eggs into small pieces. Stir in rice and Cheese; cook on HIGH about 1 minute or until thoroughly heated. Serve immediately or spoon mixture into warmed corn tortillas.",
    "category": "brunch"
  },
  {
    "id": 1659,
    "ingredients": [
      "cheese",
      "salt",
      "pimento",
      "rice",
      "black olive",
      "jack cheese",
      "ripe olives",
      "egg",
      "monterey jack"
    ],
    "directions_list": [
      "pour"
    ],
    "directions_string": " Combine chiles, rice, Cheese, and pimento.  Press into bottom and sides of two greased 8-inch or 9-inch pie pans.  Mix eggs and salt; pour over rice mixture.  Bake at 350 degrees 25 to 30 minutes or until set. Cut into wedges.",
    "category": "brunch"
  },
  {
    "id": 1695,
    "ingredients": [
      "catsup",
      "ketchup",
      "mustard",
      "chili sauce"
    ],
    "directions_list": [
      "serve",
      "slice",
      "roll",
      "microwave",
      "bake",
      "dough"
    ],
    "directions_string": "Preheat the oven to 375° F. Cook the breakfast links in a non-stick skillet or in the microwave according to package directions. Roll dough for each roll to about 6\" x 3\" and slice in half the long way. Wrap each section of dough around 1 link. Put on a non-stick cookie sheet and bake for about 12 minutes, until dough is starting to brown. If desired, serve with condiments such as mustard, ketchup or catsup or chili sauce.",
    "category": "dinner"
  },
  {
    "id": 1706,
    "ingredients": [
      "apple",
      "baking soda",
      "egg",
      "flour",
      "all-purpose flour",
      "raisins",
      "honey",
      "wheat flour",
      "cream of tartar",
      "apple",
      "apple juice",
      "soy flour",
      "applesauce",
      "vanilla",
      "bananas",
      "banana",
      "allspice"
    ],
    "directions_list": [
      "stir",
      "can",
      "dry",
      "top",
      "mix"
    ],
    "directions_string": " Combine dry ingredients in bowl. Set aside.  Mix apple juice, vanilla, 3 egg whites, banana, applesauce and honey in bowl on low speed until blended.  Add dry ingredients and mix for a few seconds, just until moistened and no flour can be detected. With a spatula, stir in the remaining egg whites, which have been lightly beaten. Then add the diced Apple and Raisins. Put 19 paper cupcake liners in muffin tins and fill cups to within 1/3 inch of top.  Bake at 350° F for 10-24 minutes or until you can touch lightly on top and an imprint does not remain. ",
    "category": "breakfast"
  },
  {
    "id": 1736,
    "ingredients": [
      "chicken stock",
      "black pepper",
      "celery",
      "sausage",
      "oregano",
      "ham",
      "salt",
      "green peppers",
      "thyme",
      "green bell pepper",
      "catfish",
      "tomato",
      "rice",
      "garlic",
      "basil",
      "onion",
      "catfish"
    ],
    "directions_list": [
      "simmer",
      "fillet",
      "salt"
    ],
    "directions_string": " Place a Dutch oven or a large, cast-iron pot over medium heat. Add sausage and sauté until lightly browned. Add ham and cook for 10 to 15 minutes. Stir in onions, celery, green bell pepper or green peppers and garlic and cook for another 10 to 15 minutes. Add tomatoes, thyme, oregano, black pepper and basil. Cook, stirring, for another 5 to 10 minutes. Add chicken stock and simmer for 1 hour, stirring occasionally. Add rice and cook for 10 minutes or until the rice has absorbed all of the liquid. Add catfish fillet pieces and cook for another 10 minutes or until flakes easily when tested with a fork. The jambalaya should be thick but not soupy. Add salt to taste and adjust the other seasonings if desired. Serve on large, rimmed dinner plates or in soup bowls. ",
    "category": "dinner"
  },
  {
    "id": 1759,
    "ingredients": [
      "milk",
      "cheese",
      "salt",
      "hot pepper sauce",
      "parsley",
      "rice",
      "mustard",
      "pepper",
      "cheddar",
      "egg"
    ],
    "directions_list": [
      "pour",
      "salt"
    ],
    "directions_string": " Alternate layers of rice and Cheese in greased shallow 2-quart baking dish, ending with Cheese on top. Sprinkle with parsley. Mix milk, eggs, pepper sauce, pepper, salt and mustard in medium bowl; pour over layers. Cover; refrigerate several hours or overnight. Bake at 325 degrees 45 minutes, or until firm. Allow to stand about 15 minutes before serving.",
    "category": "brunch"
  },
  {
    "id": 1818,
    "ingredients": [
      "black pepper",
      "oregano",
      "margarine",
      "egg",
      "flour",
      "pecans",
      "salt",
      "cooking spray",
      "granulated sugar",
      "cereals",
      "wild rice",
      "green onions",
      "apple",
      "buttermilk",
      "rice",
      "butter",
      "milk",
      "bell pepper",
      "grain",
      "baking powder",
      "water",
      "shrimp",
      "sugar"
    ],
    "directions_list": [
      "heat",
      "blend",
      "top"
    ],
    "directions_string": " Prepare rice using 2 cups water and omitting butter or margarine. Combine milk, buttermilk and egg whites in large bowl. Add flour, Granulated sugar or Sugar, baking powder and salt; blend until batter is fairly smooth. Stir in rice, green onions, Apple, red pepper and pecans. Pour 1/4 cup batter on hot griddle coated with cooking spray; spreading out flat with back of spatula. Cook over medium heat until bubbles form on top and underside is lightly browned; about 1-1/2 minutes per side.",
    "category": "brunch"
  },
  {
    "id": 1820,
    "ingredients": [
      "olive oil",
      "salt",
      "black pepper",
      "water",
      "tofu",
      "pepper",
      "cottage cheese"
    ],
    "directions_list": [],
    "directions_string": "* Cut open the box of tofu, and slide its contents into a medium-sized saucepan. Add water to cover, and bring to a boil.",
    "category": "dinner"
  },
  {
    "id": 1846,
    "ingredients": [
      "cheese",
      "red bell pepper",
      "hass avocado",
      "salsa",
      "egg",
      "chocolate",
      "salt",
      "sour cream",
      "california avocado",
      "savory",
      "onion",
      "green bell pepper",
      "avocado",
      "tomato",
      "jack cheese",
      "butter",
      "onion",
      "bell pepper"
    ],
    "directions_list": [
      "warm",
      "stir",
      "saute",
      "cream",
      "sprinkle",
      "top",
      "pour",
      "beat"
    ],
    "directions_string": " Wrap tortillas in foil; warm in a 400 °F oven.  While the tortillas heat, saute bell pepper and Onion in butter until soft, about 5 minutes.  Meanwhile beat together eggs and salt.  When vegetables are done, pour egg into pan; gently stir in avocado.  Cook, over medium-low heat, stirring constantly, until soft curds form, about 3 minutes.  Put ¼ of the egg mixture down the center of one warmed tortilla; sprinkle with 2 tablespoons Cheese.  Fold in top and bottom of each tortilla.  Roll up from side.  Repeat with each tortilla.  Garnish each burrito with a dollop of sour cream and a spoonful of salsa.",
    "category": "brunch"
  },
  {
    "id": 1999,
    "ingredients": [
      "cheese",
      "cornmeal",
      "cheddar"
    ],
    "directions_list": [],
    "directions_string": "1 Source: best of the best from vieginia - selected recipes from Virginia\"s favorite cookbooks, ",
    "category": "dinner"
  },
  {
    "id": 2025,
    "ingredients": [
      "salt",
      "oil",
      "beef",
      "tomato",
      "ground beef",
      "tortillas",
      "garlic",
      "cheese",
      "chili powder",
      "onion"
    ],
    "directions_list": [
      "oil",
      "heat",
      "salt"
    ],
    "directions_string": " Brown together ground beef, onion and garlic in a heavy frying pan over medium heat, stirring until meat loses its pinkness. Add salt and chili powder, blending well. Place ½ cup of the ground beef filling. ½ cup shredded cheese and ¼ cup diced tomatoes onto one-half of each tortilla. Fold other half over filling, pressing it down to remove any air pockets. Pour oil into large skillet to ¼ inch depth. When oil is hot, place filled tortillas into pan a few at a time. Saute over medium to high heat until golden on each side, about 45 seconds per side. Remove from pan onto paper towelling. Cut into wedges to serve. That what we have this in our dinner. ",
    "category": "dinner"
  },
  {
    "id": 2089,
    "ingredients": [
      "cheese",
      "paprika",
      "mustard",
      "cheddar",
      "potato"
    ],
    "directions_list": [
      "top",
      "dry"
    ],
    "directions_string": "1 From: grandma sheila, cooking echo split hot dogs the long way not quite all the way through. 2 Fill split opening with mashed potatoes mixed with dry mustard. 3 Sprinkle the top with paprika. 4 Bake in 375 degree oven for about 15 minutes or until heated through and slightly browned on top. 5 Can also be topped with some grated Cheese (Cheddar or parmesan). 6 These make a great lunch or dinner for kids. 7 Mine used to ask for them regularly - still do now that they are grown. ",
    "category": "dinner"
  },
  {
    "id": 2464,
    "ingredients": [
      "cheddar",
      "beef",
      "potato",
      "ketchup",
      "ground beef",
      "hamburger buns",
      "water",
      "cheese"
    ],
    "directions_list": [
      "reduce"
    ],
    "directions_string": " Cook beef in 10-inch skillet over medium heat, stirring occasionally, until brown; drain. Slightly crush potatoes. Stir potatoes and remaining ingredients except cheese and buns into beef in skillet. Heat to boiling, stirring occasionally; reduce heat. Simmer uncovered about 15 minutes or until most of the liquid is absorbed and potatoes are tender. Stir in cheese until melted. Fill buns with beef mixture. High altitude (3500 – 6500 ft): increase hot water to 2½ cups.",
    "category": "lunch"
  },
  {
    "id": 2500,
    "ingredients": [
      "black peppercorns",
      "red bell pepper",
      "lime",
      "black pepper",
      "cilantro",
      "celery",
      "salt",
      "oil",
      "veal",
      "beef",
      "pepper",
      "black beans",
      "avocado",
      "hass avocado",
      "green onion",
      "red wine",
      "garlic",
      "lime juice",
      "onion",
      "limes",
      "chicken breasts",
      "bell pepper",
      "yellow onion",
      "red onion",
      "water",
      "plantain",
      "california avocados",
      "bay leaf",
      "jalapeño pepper",
      "chicken",
      "carrot",
      "cumin",
      "vegetable oil"
    ],
    "directions_list": [
      "bone",
      "skin",
      "pour",
      "cut",
      "layer",
      "rub"
    ],
    "directions_string": " Remove back bone and all other bones from each chicken except wing bones; flatten or flatten boneless chicken breast. Generously rub each with spice rub; reserve. Season 1 chicken with salt; grill, turning occasionally, until skin is crisp and flesh is just firm to the touch, about 5 minutes meanwhile, cut 1 avocado into wedges; sauté in a little oil. Keep warm. Sauté foie gras in a little oil; keep warm. To assemble the dish: pour ¼ cup heated tomatillo sauce in the center of a large dinner plate; layer with ⅓ cup heated grilled vegetables, sautéed avocado, and ¼ cup heated cumin-scented black beans. Top with grilled chicken. Garnish with foie gras, ¼ cup heated red wine sauce, plantain ring, sprigs of cilantro, and lime.",
    "category": "dinner"
  },
  {
    "id": 2507,
    "ingredients": [
      "cheese",
      "swiss cheese",
      "ham"
    ],
    "directions_list": [
      "slice",
      "cut",
      "dough"
    ],
    "directions_string": "Heat oven to 425 °F. On lightly floured surface unroll pizza dough; cut into quarters.<br />Press each square of dough into 7x4 1/2-inch rectangle. <br />Layer 1/4 Ham, 1 slice Cheese and 1/4 cup coleslaw to within 1/2 inch of edge on each piece of dough. <br />Roll dough up, starting on short side; seal edge and ends well. <br />Place sandwiches, seam-side down, on greased baking sheet.<br />Bake for 10 to 12 minutes or until golden brown.* Makes 4 sandwiches* Nutritional Info Per 1 Sandwich: Calories: 590, Protein: 35 g, Carbohydrate: 70 g, Fiber: 0 g, Fat: 20 g, Cholesterol: 70 mg, Sodium: 1560 mg",
    "category": "lunch"
  },
  {
    "id": 2516,
    "ingredients": [
      "garlic powder",
      "lettuce",
      "black pepper",
      "ham",
      "miracle whip",
      "tomato",
      "mayonnaise",
      "salad dressing",
      "processed cheese",
      "mayo"
    ],
    "directions_list": [
      "bread"
    ],
    "directions_string": " Mix mayonnaise or mayo and seasonings. Spread bread slices with mayonnaise or mayo mixture. Layer 4 of the bread slices each with lettuce, tomato, ham and 2 singles. Top with remaining bread slices.",
    "category": "lunch"
  },
  {
    "id": 2520,
    "ingredients": [
      "lettuce",
      "french bread",
      "italian bread",
      "mayonnaise",
      "green bell pepper",
      "olive oil",
      "green pepper",
      "tomato",
      "mayonnaise",
      "mayo"
    ],
    "directions_list": [
      "cut",
      "bread"
    ],
    "directions_string": "Mix dressings.<br />Toss lettuce with 1/4 cup of the dressing mixture.<br />Brush cut surfaces of rolls with remaining dressing mixture.<br />Fill rolls with meat, Singles and lettuce mixture. <br />Top with tomato and green bell pepper or green pepper slices, if desired.* Makes 4 servings* Great Substitute: Prepare as directed, substituting 1 loaf Italian bread, cut in half lengthwise, for French bread rolls.",
    "category": "lunch"
  },
  {
    "id": 2525,
    "ingredients": [
      "milk",
      "flour",
      "lettuce",
      "mayo",
      "ham",
      "mayonnaise",
      "mayonnaise"
    ],
    "directions_list": [
      "roll"
    ],
    "directions_string": "Spread tortilla with mayonnaise or mayo.<br />Top with lettuce, Singles, Ham and pickle; roll up.<br />Wrap tightly in plastic wrap. Refrigerate until ready to serve.* Makes 1 sandwich* Great Substitute: Prepare as directed, using KRAFT mayonnaise or mayo Light Mayonnaise and KRAFT 2% milk Singles.* Great Substitute: Substitute MIRACLE WHIP Dressing for the mayonnaise or mayo.* Nutritional Info Per Serving: Calories 310, Total fat 20g, Saturated fat 6g, Cholesterol 45 mg, Sodium 1230 mg, Carbohydrate 18g, Dietary fiber 1g, Sugars 2g, Protein 14g",
    "category": "lunch"
  },
  {
    "id": 2535,
    "ingredients": [
      "cheddar",
      "lettuce",
      "turkey",
      "ground beef",
      "pineapple",
      "onion",
      "green",
      "cheese",
      "red onion"
    ],
    "directions_list": [
      "barbecue",
      "cut",
      "skin",
      "broil"
    ],
    "directions_string": " Twist off crown from pineapple. Cut pineapple in half lengthwise. Cover and refrigerate one-half for later use. Remove skin from remaining half; cut into ¼-inch slices. Shape meat into 8 (4-inch) patties. Grill or broil meat 10 to 15 minutes on each side or until meat is no longer pink in center, brushing occasionally with barbecue sauce and adding pineapple the last 10 to 15 minutes of grilling. Serve burgers on buns with lettuce, pineapple, cheese, and onion.",
    "category": "lunch"
  },
  {
    "id": 2536,
    "ingredients": [
      "ham",
      "horseradish",
      "mozzarella",
      "mustard",
      "cheese",
      "green olive"
    ],
    "directions_list": [
      "roll",
      "dough"
    ],
    "directions_string": " Heat oven to 400°F. Grease cookie sheet. Unroll pizza crust dough; shape into 12x8-inch rectangle. Arrange ham slices evenly on dough to within ½ inch of outer edges. Sprinkle cheese evenly over ham. Starting at short end of rectangle, roll dough into log shape. Pinch seam together with your fingertips and place log, seam-side down, on prepared cookie sheet. Bake 25 to 30 minutes or until deep golden brown. Let stand at least 10 minutes. Cut into slices to serve. Serve with mustard or horseradish sauce, if desired.",
    "category": "lunch"
  },
  {
    "id": 2538,
    "ingredients": [
      "bagel",
      "savory",
      "mayonnaise",
      "onion",
      "brown sugar",
      "tomato",
      "ham",
      "garlic",
      "wheat",
      "mayonnaise",
      "milk",
      "mayo"
    ],
    "directions_list": [
      "top"
    ],
    "directions_string": "Spread 1 of the bagel halves with dressing; top with Ham and tomato.<br />Top with 2% milk Singles and remaining bagel half. <br />Place on microwavable plate.<br />Microwave on high 20 seconds or until 2% milk Singles begins to melt.* Makes 1 serving* Great Substitute: Prepare as directed, using your favorite savory bagel, such as honey Wheat or garlic.* Nutritional Info Per Serving: Calories 300, Total fat 8g, Saturated fat 3g, Cholesterol 40 mg, Sodium 1370 mg, Carbohydrate 37g, Dietary fiber 2g, Sugars 4g, Protein 19g* Diet Exchange: 2-1/2 Starch,2 Meat (VL),1 Fat",
    "category": "lunch"
  },
  {
    "id": 2539,
    "ingredients": [
      "cheese",
      "hamburger buns",
      "beef",
      "ground beef",
      "american cheese",
      "cheese"
    ],
    "directions_list": [
      "grill",
      "slice",
      "press",
      "top"
    ],
    "directions_string": " Heat gas grill on medium or charcoal grill until coals are ash white. Meanwhile, shape ground beef into 8 (½-inch thick) patties. Place 1 slice cheese on top of each of 4 patties. Top each with 1 meat patty; press around edge to seal. Place patties on grill. Grill, turning once, until burgers are cooked through (15 to 18 minutes). Serve burgers on buns.",
    "category": "lunch"
  },
  {
    "id": 2543,
    "ingredients": [
      "cheese",
      "mozzarella",
      "spaghetti"
    ],
    "directions_list": [
      "press",
      "roll",
      "slice",
      "dough"
    ],
    "directions_string": "Heat oven to 375 °F. Separate dough into 4 rectangles; firmly press perforations to seal. <br />Press or roll into four 7x5-inch rectangles. <br />Arrange 9 pepperoni slices in center third of each rectangle. <br />Spread 1 tablespoon spaghetti sauce over pepperoni.<br />Fold each slice of Cheese in half; place over pepperoni. <br />Fold short sides of dough to almost meet in center; securely pinch edges together, leaving middle open. <br />Tuck 4 or 5 pepperoni slices into middle opening. <br />Place on ungreased cookie sheet.<br />Bake at 375 °F. for 13 to 16 minutes or until golden brown.* Makes 4 sandwiches* Nutritional Info Per 1 Sandwich: Calories 460, Calories from Fat 270, Total Fat 30 g, Saturated 11 g, Cholesterol 45 mg, Sodium 1240 mg, Total Carbohydrate 26 g, Dietary Fiber 1 g, Sugars 5 g, Protein 21 g* Diet Exchange: 1 1/2 Starch, 2 Medium-Fat meat, 4 Fat OR 1 1/2 Carbohydrate, 2 Medium-Fat meat, 4 Fat",
    "category": "dinner"
  },
  {
    "id": 2544,
    "ingredients": [
      "cheese",
      "cheddar",
      "peas",
      "flour",
      "pepper",
      "rice",
      "mushroom",
      "beef"
    ],
    "directions_list": [
      "warm",
      "heat",
      "fold"
    ],
    "directions_string": "Brown ground Beef in medium nonstick skillet over medium-high heat until thoroughly cooked, stirring frequently. Drain.<br />Add frozen rice mixture and pepper. <br />Reduce heat to medium-low; cover and cook 8 to 10 minutes or until rice and vegetables are tender, stirring occasionally to break apart rice and vegetables.<br />Spoon about 1 cup mixture down center of each warm tortilla. <br />Top with Cheese. Fold up bottom of each tortilla; fold in sides. <br />If desired, enclose bottoms of wraps in foil.* Makes 2 wraps* Nutritional Info Per 1 Wrap: Calories 640, Calories from Fat 270, Total Fat 30 g, Saturated 13 g, Cholesterol 100 mg, Sodium 990 mg, Total Carbohydrate 57 g, Dietary Fiber 4 g, Sugars 3 g, Protein 36 g* Diet Exchange: 3 1/2 Starch, 1/2 Vegetable, 3 1/2 High-Fat meat OR 3 1/2 Carbohydrate, 1/2 Vegetable, 3 1/2 High-Fat meat",
    "category": "dinner"
  },
  {
    "id": 2548,
    "ingredients": [
      "cheese",
      "bacon",
      "bacon",
      "margarine",
      "egg",
      "salt",
      "pepper",
      "american cheese",
      "onion",
      "green bell pepper",
      "butter",
      "onion",
      "bell pepper",
      "cheese"
    ],
    "directions_list": [
      "combine",
      "warm",
      "stir",
      "salt",
      "blend"
    ],
    "directions_string": " Bake Pillsbury ® Grands! ® Refrigerated Buttermilk Biscuits as directed on package; keep warm. Prepare 8 slices of Hormel ® bacon as package directs. Melt margarine in medium skillet over medium heat. Add bell pepper and onion; cook and stir 2 minutes or until tender. In small bowl, combine eggs, salt and pepper; blend well. Add to mixture in skillet. Cook until egg mixture is almost set but still moist, stirring occasionally. To serve, split warm biscuits. Spoon egg mixture evenly onto bottom half of each biscuit. Top each with cheese, bacon and remaining biscuit half.",
    "category": "brunch"
  },
  {
    "id": 2551,
    "ingredients": [
      "cheese",
      "lettuce",
      "leaf lettuce",
      "corn",
      "green peppers",
      "american cheese",
      "green bell pepper",
      "butter",
      "onion",
      "beef"
    ],
    "directions_list": [
      "roast",
      "barbecue"
    ],
    "directions_string": "Melt butter in 10-inch skillet until sizzling; add onions. <br />Cook over medium-high heat, stirring occasionally, until softened (4 to 6 minutes).<br />Add barbecue sauce, roast Beef and corn. <br />Continue cooking, stirring occasionally, until heated through (4 to 6 minutes).<br />Fill each pita half with 1 lettuce leaf, 2 halves Cheese and about 1/3 cup Beef mixture.* Makes 6 servings* Nutritional Info Per 1 Serving: Calories 480, Fat 18 g, Cholesterol 70 mg, Sodium 2030 mg, Carbohydrates 53 g, Dietary Fiber 4 g, Protein 29 g",
    "category": "lunch"
  },
  {
    "id": 2552,
    "ingredients": [
      "turkey",
      "jack cheese",
      "hamburger buns",
      "cheese",
      "chicken"
    ],
    "directions_list": [
      "barbecue",
      "heat",
      "top"
    ],
    "directions_string": " Mix ground turkey or turkey, barbecue sauce and chilies. Shape mixture into 4 patties, each about ¾ inch thick. Set oven control to broil. Place patties on rack in broiler pan. Broil with tops about 3 inches from heat 10 to 14 minutes, turning once, until ground turkey or turkey is no longer pink in center. About 1 minute before burgers are done, top each with cheese slice. Broil until cheese is melted.",
    "category": "lunch"
  },
  {
    "id": 2554,
    "ingredients": [
      "cheese",
      "lettuce",
      "leaf lettuce",
      "cheddar",
      "flour",
      "honey",
      "american cheese",
      "tomato",
      "ham",
      "salad dressing",
      "swiss cheese",
      "turkey"
    ],
    "directions_list": [
      "slice",
      "sprinkle"
    ],
    "directions_string": "Spread each tortilla evenly with 1 tablespoon salad dressing; sprinkle with 1 tablespoon tomato. <br />Top with 1 lettuce leaf, 1 slice Turkey, 1 slice Swiss cheese, 1 slice Ham and 1 slice Cheddar Cheese. Roll up tortilla; secure with toothpicks.* Makes 4 sandwiches* Nutritional Info Per 1 Sandwich: Calories 400, Fat 23 g, Cholesterol 70 mg, Sodium 1060 mg, Carbohydrates 26 g, Dietary Fiber 1 g, Protein 24 g",
    "category": "lunch"
  },
  {
    "id": 2555,
    "ingredients": [
      "cheese",
      "lettuce",
      "cream cheese",
      "black olive",
      "provolone",
      "parsley",
      "garlic",
      "green olive",
      "ripe olives",
      "beef"
    ],
    "directions_list": [
      "cut",
      "mix",
      "cream"
    ],
    "directions_string": "Combine black olive or ripe olives, stuffed green olives and parsley in medium bowl. <br />Add cream cheese; mix well.<br />Spread half of cream cheese mixture on cut-sides of each focaccia half.<br /> Layer lettuce, 4 slices Cheese, Beef and remaining Cheese on bottom half of focaccia. <br />Top with remaining half of focaccia.<br />To serve, cut focaccia into eight wedges.* Makes 8 sandwiches* Nutritional Info Per 1 Sandwich: Calories 380, Fat 19 g, Cholesterol 60 mg, Sodium 1340 mg, Carbohydrates 28 g, Dietary Fiber 0 g, Protein 23 g",
    "category": "lunch"
  },
  {
    "id": 2574,
    "ingredients": [
      "salt",
      "avocado",
      "bread",
      "california avocados",
      "hass avocado",
      "butter"
    ],
    "directions_list": [],
    "directions_string": "Toast bread, med ",
    "category": "dinner"
  },
  {
    "id": 2575,
    "ingredients": [
      "garlic powder",
      "cheese",
      "lettuce",
      "black pepper",
      "hass avocado",
      "colby",
      "flour",
      "salt",
      "sour cream",
      "pepper",
      "onion",
      "olive oil",
      "avocado",
      "red wine vinegar",
      "california avocados"
    ],
    "directions_list": [],
    "directions_string": "Dice avocados then put in medium size bowl",
    "category": "dinner"
  },
  {
    "id": 2590,
    "ingredients": [
      "yogurt",
      "lime",
      "powdered sugar",
      "avocado",
      "mango",
      "pasta",
      "pineapple",
      "oranges",
      "lime juice"
    ],
    "directions_list": [
      "combine"
    ],
    "directions_string": "In a large bowl, combine mango,avocado,pineapple, and mandarine oranges. ",
    "category": "dinner"
  },
  {
    "id": 2593,
    "ingredients": [
      "cheese",
      "bacon",
      "hass avocado",
      "colby",
      "flour",
      "oil",
      "sour cream",
      "california avocado",
      "chicken",
      "avocado",
      "tomato",
      "california avocados"
    ],
    "directions_list": [
      "oil",
      "top"
    ],
    "directions_string": "Lightly oil iron skillet- place one tortilla on hot skillet- top with Chicken, Bacon, Cheese and avocado on one side of the tortilla.",
    "category": "dinner"
  },
  {
    "id": 2668,
    "ingredients": [
      "lime",
      "hass avocados",
      "hass avocado",
      "chile",
      "salt",
      "pepper",
      "onion",
      "tomato",
      "garlic",
      "lime juice",
      "chile peppers",
      "milk",
      "garlic salt",
      "potato"
    ],
    "directions_list": [],
    "directions_string": "First, smash the avocados in a glass or metal bowl with a Potato smasher until most lumps smooth out.",
    "category": "dinner"
  },
  {
    "id": 2893,
    "ingredients": [
      "kiwi",
      "arrowroot starch",
      "lemon",
      "oranges",
      "cantaloupe",
      "apple",
      "cinnamon",
      "pineapple",
      "cornstarch",
      "maple syrup",
      "watermelon",
      "vanilla",
      "strawberries",
      "tofu",
      "kiwi fruits",
      "grapes",
      "banana"
    ],
    "directions_list": [
      "mix"
    ],
    "directions_string": " Mash the banana in the bowl you intend to eat out of, and mix thoroughly with the hot cereal. Stir in the remaining ingredients and enjoy!",
    "category": "breakfast"
  },
  {
    "id": 2899,
    "ingredients": [
      "cinnamon",
      "oil",
      "water",
      "sea salt",
      "tofu",
      "vanilla extract",
      "whole grain",
      "maple syrup",
      "whole grains"
    ],
    "directions_list": [
      "toast",
      "oil",
      "bread"
    ],
    "directions_string": " Blend all ingredients but the bread in your blender or food processor.  Heat a frying pan on medium-high, adding a little oil to keep French toast from sticking.  Dip the bread in the tofu mixture until well-coated but not soggy and place a couple of dipped slices in the hot pan.  Cook for a few minutes on each side until lightly browned.  Make sure that before cooking each batch of French toast you add a little more oil to the pan.",
    "category": "brunch"
  },
  {
    "id": 3040,
    "ingredients": [
      "basmati rice",
      "salt",
      "parsley",
      "sweet potato",
      "orange juice",
      "wild rice"
    ],
    "directions_list": [
      "can"
    ],
    "directions_string": " Fill into plastic lunch box. Mix for cooking. Nuke for 10 minutes on high. Note: this can also be made using a pre-cooked sweet potato. Then the nuke time is reduced to 3 minutes for reheating.",
    "category": "lunch"
  },
  {
    "id": 3096,
    "ingredients": [
      "cream cheese",
      "nectarine",
      "black pepper",
      "pepper",
      "basil",
      "chile",
      "bagel"
    ],
    "directions_list": [
      "cream"
    ],
    "directions_string": " Toast bagels and spread with cream cheese (1-1/2 tablespoons per bagel half). Top with basil leaves and nectarines slices. Sprinkle with pepper and/or chili flakes.",
    "category": "breakfast"
  },
  {
    "id": 3206,
    "ingredients": [
      "milk",
      "cinnamon",
      "applesauce",
      "rice",
      "egg",
      "butter"
    ],
    "directions_list": [
      "beat"
    ],
    "directions_string": "Combine Bisquick, cinnamon, milk, and eggs in large bowl; beat only until smooth. Stir in rice and applesauce. ",
    "category": "brunch"
  },
  {
    "id": 3260,
    "ingredients": [
      "yogurt",
      "baking soda",
      "egg",
      "flour",
      "all-purpose flour",
      "salt",
      "cooking spray",
      "oil",
      "granulated sugar",
      "rice",
      "milk",
      "baking powder",
      "sugar",
      "banana",
      "vegetable oil"
    ],
    "directions_list": [],
    "directions_string": " Cook rice and milk in 2-quart saucepan over medium heat until thick and creamy, 5 to 8 minutes, stirring frequently. Remove from heat; cool. Stir in vanilla and sugar substitute. Just before serving, mash banana; fold banana and whipped cream into pudding. Garnish with kiwi or kiwi fruit slices.",
    "category": "brunch"
  },
  {
    "id": 3382,
    "ingredients": [
      "milk",
      "cheese",
      "salt",
      "paprika",
      "black pepper",
      "rice",
      "pepper",
      "cheddar",
      "american cheese",
      "egg",
      "cumin"
    ],
    "directions_list": [
      "pour",
      "bake"
    ],
    "directions_string": " Combine rice, 3/4 cup Cheese, and 2 eggs (slightly beaten) in large bowl. Press mixture equally into bottoms and sides of 12 greased muffin cups. Bake at 400 degrees 5 to 8 minutes, or until lightly browned. Blend chiles, pimientos, cumin, salt, pepper, milk, and remaining 1/2 cup Cheese and 2 eggs in small bowl; pour equally into cups. Sprinkle with paprika. Return to oven; bake 15 to 20 minutes, or until set.",
    "category": "brunch"
  },
  {
    "id": 3383,
    "ingredients": [
      "yogurt",
      "cereals",
      "brown sugar",
      "blueberries",
      "rice",
      "grain",
      "orange juice"
    ],
    "directions_list": [],
    "directions_string": " Combine rice, 3/4 cup Cheese, and 2 eggs (slightly beaten) in large bowl. Press mixture equally into bottoms and sides of 12 greased muffin cups. Bake at 400 degrees 5 to 8 minutes, or until lightly browned. Blend chiles, pimientos, cumin, salt, pepper, milk, and remaining 1/2 cup Cheese and 2 eggs in small bowl; pour equally into cups. Sprinkle with paprika. Return to oven; bake 15 to 20 minutes, or until set.",
    "category": "brunch"
  },
  {
    "id": 3399,
    "ingredients": [
      "cheddar",
      "monterey jack",
      "salsa",
      "egg",
      "refried beans",
      "cooking spray",
      "jack cheese",
      "rice",
      "chili powder",
      "brown rice",
      "cheese",
      "cumin",
      "egg substitute"
    ],
    "directions_list": [
      "heat",
      "scramble",
      "top"
    ],
    "directions_string": " Heat large skillet coated with cooking spray over medium-high heat until hot. Add egg substitute, chili powder and cumin; scramble until set. Stir in rice. Remove from heat; set aside. Spoon ¼ cup refried beans or beans into each tortilla; top with 2 tablespoons eggs, 2 tablespoons cheese, salsa and green chiles, if desired. Top with salsa or add chiles to mixture for a spicier version. ",
    "category": "brunch"
  },
  {
    "id": 3402,
    "ingredients": [
      "milk",
      "brown rice",
      "cinnamon",
      "cooking spray",
      "applesauce",
      "buttermilk",
      "rice",
      "margarine",
      "egg"
    ],
    "directions_list": [
      "brown",
      "heat",
      "stir",
      "top"
    ],
    "directions_string": " Combine baking mix, cinnamon, milk and egg whites in large bowl; stir until smooth. Stir in rice and applesauce.  Pour 1/4 cup batter onto hot griddle coated with cooking spray.  Cook over medium heat until bubbles form on top and underside is lightly browned.  Turn to brown other side. Serve with syrup and margarine.",
    "category": "brunch"
  },
  {
    "id": 3412,
    "ingredients": [
      "cheese",
      "black pepper",
      "celery",
      "grains",
      "cheddar",
      "margarine",
      "egg",
      "salt",
      "pepper",
      "american cheese",
      "green bell pepper",
      "green pepper",
      "rice",
      "mushroom",
      "butter",
      "milk",
      "brown rice"
    ],
    "directions_list": [
      "stir",
      "salt",
      "heat",
      "separate",
      "pour"
    ],
    "directions_string": "Cook celery, pepper and Mushrooms in butter in large skillet over medium-high heat 2 minutes. Combine eggs, milk, salt and black pepper in small bowl. Reduce heat to medium and pour egg mixture over vegetables. Continue stirring 1-1/2 to 2 minutes. Add rice and Cheese; stir to gently separate grains. Heat 2 minutes.",
    "category": "brunch"
  },
  {
    "id": 3533,
    "ingredients": [
      "cheese",
      "cream",
      "sausage",
      "cheddar",
      "egg",
      "heavy cream",
      "salt",
      "pepper",
      "ham",
      "heavy whipping cream",
      "potato"
    ],
    "directions_list": [
      "salt",
      "cream",
      "broil",
      "heat",
      "bread",
      "sprinkle",
      "top",
      "bake",
      "mix"
    ],
    "directions_string": " Pre heat oven to 375 degrees. In bowl mix cream and eggs and set aside. In a caserole dish line with 5 slices of bread. Then sprinkle over the bread the 1/2 the Ham, half the Sausage, and half the Cheese and 1/2 the egg and cream mixture. Put the other 5 pieces of bread on top of that. Add on top of that bread the other half of the Ham, Sausage, Cheese, and egg and cream mixture. Season with salt and pepper to taste then bake for 1 hour at 375 degrees. Then pull out of oven and springle chips on top and broil for 2 minutes until brown. Let stand for 10 minutes and serve.",
    "category": "breakfast"
  },
  {
    "id": 3550,
    "ingredients": [
      "cheese",
      "black pepper",
      "cheddar",
      "egg",
      "salt",
      "cooking spray",
      "oil",
      "black olive",
      "pepper",
      "onion",
      "olive oil",
      "tomato",
      "garlic",
      "basil",
      "wheat",
      "mushroom",
      "bell pepper"
    ],
    "directions_list": [
      "stuff",
      "salt",
      "saute",
      "serve",
      "chunk",
      "oil",
      "raw",
      "top"
    ],
    "directions_string": " Heat oil in a nonstick skillet on medium heat. Add sliced Onion and bell pepper and saute for 3 or 4 minutes. If using Mushrooms, basil and/or garlic, add them now. (Spray Mushrooms briefly with cooking spray.) Saute another minute or two. Don't allow the garlic to brown. Add salt and pepper to eggs and stir. Don't completely combine. Pour into the skillet over the veggies and continue to cook until set on the bottom. To help the frittata release, you may wish to spray the sides of the pan above the omelet with more cooking spray. Lift the edges as they set, allowing raw egg to run underneath. When it won't run any more, be sure it is loose and will slide. If the handle of your pan isn't oven-proof, you must slide the omelet out onto an oven proof platter. Otherwise leave it in the pan. Arrange the tomatoes on top the omelet. Sprinkle with the Cheese. Place as far as possible from the flame of your broiler until the Cheese melts. Offer extra black pepper and serve with whole Wheat toast, or if the family is off and running, wrap a chunk up in a tortilla or stuff it in a pita.",
    "category": "breakfast"
  },
  {
    "id": 3588,
    "ingredients": [
      "sucanat",
      "salt",
      "water",
      "vanilla",
      "baking soda",
      "whole wheat flour",
      "molasses"
    ],
    "directions_list": [
      "dry"
    ],
    "directions_string": " Mix all dry ingredients together in a bowl.  Mix in water to desired consistency. The thicker the batter the higher the pancake.  Fry in non-stick pan until golden brown. ",
    "category": "breakfast"
  },
  {
    "id": 3610,
    "ingredients": [
      "yogurt",
      "orange peel",
      "oat bran",
      "raisins",
      "oil",
      "oats",
      "honey",
      "sunflower seeds",
      "milk",
      "dried banana",
      "water",
      "vanilla",
      "banana",
      "vegetable oil"
    ],
    "directions_list": [
      "mix"
    ],
    "directions_string": " Heat oven to 350 °F. Combine oat bran, oats, dried milk, honey, sunflower seeds, oil, water, orange peel, and vanilla; mix well. Spread in a 13 x 9-inch baking pan. Bake 20 to 25 minutes or until golden brown, stirring once after 10 minutes. Stir in banana chips and raisins. Cool completely. Store tightly covered up to 1 week.",
    "category": "breakfast"
  },
  {
    "id": 3646,
    "ingredients": [
      "oat bran",
      "sucanat",
      "apple",
      "cinnamon",
      "water",
      "sea salt",
      "raisins"
    ],
    "directions_list": [
      "can",
      "flavor"
    ],
    "directions_string": "There is a trick to producing a creamy lump-free oat bran. Once you have achieved this skill, you will produce a breakfast that is unparalleled in flavor and health. Allow water to come to a brisk boil, add oat bran slowly while whisking vigorously. Stir continuously at low heat. Then let stand for five minutes. If you have a lumpy mass, you can redeem yourself by throwing it into a food processor for 30 seconds. Your family will never know the difference. This breakfast cereal is filled with digestible fiber which has recently been discovered to lower blood cholesterol while increasing regularity. My daughter came up with the idea of adding slices of Apple to her oat bran and she loves it. Recipe reprinted with permission from HealthRecipes.com",
    "category": "breakfast"
  },
  {
    "id": 3656,
    "ingredients": [
      "cheese",
      "cherry",
      "cherries",
      "pineapple",
      "endive",
      "almond"
    ],
    "directions_list": [],
    "directions_string": " Using a dinner plate as a cutting board: Dice cherry or cherries, discarding pits. Fold in pineapple and goat Cheese. Divide mixture into Endive leaves. Top each with almonds. Makes 8-10 appetizers.",
    "category": "dinner"
  },
  {
    "id": 3671,
    "ingredients": [
      "granulated sugar",
      "vanilla extract",
      "flour",
      "chocolate chips",
      "salt",
      "white sugar",
      "peanut butter",
      "peanut",
      "egg yolk",
      "butter",
      "milk",
      "baking powder",
      "vanilla"
    ],
    "directions_list": [
      "stir",
      "salt",
      "serve",
      "separate",
      "fold"
    ],
    "directions_string": " Using a blender, place milk,Peanut butter,vanilla,butter,egg yolk,mix until well blended. In a separate mixing bowl add flour, salt & granulated sugar or white sugar, baking powder. Add Peanut butter mixture, stir well. Next fold in 3 T bsp. mini-chips. Pour about 1/4 cupfuls into hot waffle iron, serve warm.__NOTOC__",
    "category": "breakfast"
  },
  {
    "id": 3674,
    "ingredients": [
      "rolled oats",
      "sucanat",
      "raisins",
      "sunflower seeds",
      "apple",
      "cinnamon",
      "sea salt",
      "dates",
      "oatmeal",
      "oats",
      "water"
    ],
    "directions_list": [
      "can",
      "flavor"
    ],
    "directions_string": "Soak whole natural Oats overnight. Cook for 5 minutes or until desired consistency. If you forget to presoak your Oats, cook them for 25 minutes. The key to unburned perfect porridge is a thick heavy iron pot and keeping the stove on the lowest setting. After boiling, cover with a tight fitting lid. Cook Raisins, dates or any dried fruit or sliced Apples with Oats to soften them. You can add a mixture of powdered sesame or sunflower seeds, mixed with sucanat. rolled oats or oatmeal is a good health breakfast that will stay with you throughout the day. It has a light flavor that will not be overbearing to sleepy taste buds. Pennies per serving, it is a healthy alternative to Captain Crunch or Fruit Loops which is much more expensive and far less nutritious. Recipe reprinted with permission from HealthRecipes.com",
    "category": "breakfast"
  },
  {
    "id": 3708,
    "ingredients": [
      "water",
      "oil",
      "white miso",
      "squash",
      "canola oil",
      "orange juice",
      "miso",
      "carrot",
      "butternut squash",
      "onion"
    ],
    "directions_list": [
      "oil"
    ],
    "directions_string": " Steam squash and carrots for 10 minutes. Set aside. Sauté onions in oil until translucent. Dissolve miso in water. Place all ingredients in a blender and puree.",
    "category": "breakfast"
  },
  {
    "id": 3917,
    "ingredients": [
      "cream cheese",
      "cinnamon",
      "raisins",
      "rice"
    ],
    "directions_list": [
      "cream"
    ],
    "directions_string": " Combine cream cheese, raisins, cinnamon and honey in medium bowl. Spread evenly on rice cakes.",
    "category": "brunch"
  },
  {
    "id": 3948,
    "ingredients": [
      "cheese",
      "cream",
      "cheddar",
      "egg",
      "salt",
      "pepper",
      "onion",
      "rice",
      "jack cheese",
      "mushroom",
      "light cream",
      "carrot",
      "monterey jack",
      "zucchini"
    ],
    "directions_list": [
      "salt",
      "top",
      "mix"
    ],
    "directions_string": " Combine eggs, rice, Onion, carrots, zucchini, Mushrooms, Cheese, cream, salt and pepper in bowl; mix well.  Transfer mixture to buttered 9x13-inch baking pan. Bake at 400 degrees 20 to 25 minutes or until eggs are set and top is golden.",
    "category": "brunch"
  },
  {
    "id": 3962,
    "ingredients": [
      "cream",
      "margarine",
      "cranberries",
      "salt",
      "raisins",
      "brown sugar",
      "cinnamon",
      "rice",
      "butter",
      "brown rice",
      "milk",
      "water",
      "cranberry",
      "nuts"
    ],
    "directions_list": [
      "brown",
      "simmer",
      "stir"
    ],
    "directions_string": " Combine rice, salt, butter, raisins and cinnamon with water 2- to 3-quart saucepan. Bring to a boil; stir once or twice.  Reduce heat, cover, and simmer 45 to 55 minutes, or until rice is tender and liquid is absorbed. Fluff with fork. Serve with milk or cream, honey or brown sugar, and fresh fruit or nuts, if desired.  For moister rice, add ¼ cup of water.",
    "category": "brunch"
  },
  {
    "id": 3986,
    "ingredients": [
      "margarine",
      "chicken broth",
      "egg",
      "olives",
      "parsley",
      "rice",
      "mustard",
      "chives",
      "butter",
      "milk",
      "worcestershire sauce",
      "cheese",
      "dry mustard",
      "green olives"
    ],
    "directions_list": [
      "heat",
      "mix"
    ],
    "directions_string": " Blend together cheese sauce mix and milk. Cook over low heat until sauce thickens; add eggs, olives, mustard and Worcestershire sauce. Heat thoroughly. Serve over parsley rice.",
    "category": "brunch"
  },
  {
    "id": 4025,
    "ingredients": [
      "ham",
      "salt",
      "garlic salt",
      "egg",
      "curry powder",
      "rice",
      "curry",
      "cheese",
      "chili sauce",
      "mushroom"
    ],
    "directions_list": [],
    "directions_string": " Combine cheese soup, chili sauce, mushrooms, ham, curry and salt. Heat thoroughly. Fold in eggs. Serve over fluffy rice.",
    "category": "brunch"
  },
  {
    "id": 4047,
    "ingredients": [
      "cheddar",
      "english muffin",
      "cheese",
      "mushroom"
    ],
    "directions_list": [
      "melt"
    ],
    "directions_string": " Heat up some fat-free spaghetti sauce. Toast English muffins. Cover with Kraft free sharp cheddar and mushrooms and other fat-free toppings. If the cheese doesn't melt enough, just nuke the pizzas until it is.",
    "category": "dinner"
  },
  {
    "id": 4322,
    "ingredients": [
      "peas",
      "olive oil",
      "salt",
      "paprika",
      "lemon juice",
      "water",
      "parsley",
      "sesame seed",
      "garlic",
      "lemon"
    ],
    "directions_list": [
      "juice"
    ],
    "directions_string": "* Combine chick Peas, tahini, garlic, salt, and lemon juice in a food processor. Process on high for 3 minutes, adding water as needed. Spoon out into a large dinner plate and spread evenly. Chill. (optional) Garnish with olive oil, parsley, and paprika.",
    "category": "dinner"
  },
  {
    "id": 4389,
    "ingredients": [
      "water",
      "rice",
      "butter"
    ],
    "directions_list": [
      "brown",
      "mix",
      "top"
    ],
    "directions_string": " Beat pancake mix with 1-1/2 cups water in large bowl only until smooth. Stir in rice.  Pour batter onto hot greased griddle, using about 1/4 cup for each pancake. Cook until bubbles form on top and underside is nicely browned. Turn and brown other side. Turn only once. Serve with butter and syrup, if desired.",
    "category": "brunch"
  },
  {
    "id": 4395,
    "ingredients": [
      "black pepper",
      "oregano",
      "egg",
      "salt",
      "oil",
      "green bell pepper",
      "tomato sauce",
      "parsley",
      "mozzarella",
      "green pepper",
      "rice",
      "tomato",
      "garlic",
      "basil",
      "onion",
      "cheese",
      "vegetable oil"
    ],
    "directions_list": [
      "oil",
      "salt"
    ],
    "directions_string": " Cook onion, green bell pepper or green pepper and garlic in oil in large skillet until soft but not brown. Stir in tomato sauce, basil, oregano, salt and black pepper. Cook 15 minutes over medium-low heat, stirring often. Sprinkle with parsley. Break eggs and slide carefully into sauce. Sprinkle eggs with cheese. Cover and cook slowly until eggs are of desired doneness (about 5 minutes). Place eggs on mounds of rice and cover with sauce.",
    "category": "brunch"
  },
  {
    "id": 4445,
    "ingredients": [
      "milk",
      "flour",
      "caraway seed",
      "salt",
      "cinnamon",
      "baking powder",
      "granulated sugar",
      "rice",
      "margarine",
      "sugar",
      "egg",
      "maple syrup",
      "butter"
    ],
    "directions_list": [
      "heat"
    ],
    "directions_string": " Sift flour, baking powder, Granulated sugar or Sugar and salt. Stir in combined egg yolks, milk and butter. Beat just until smooth. Fold in rice and egg whites. Bake in hot waffle iron. Serve with Honey maple syrup.  Honey maple syrup: Combine honey, maple syrup, caraway seed, cinnamon and butter; heat to boiling",
    "category": "brunch"
  },
  {
    "id": 4578,
    "ingredients": [
      "cheese",
      "rice",
      "mustard",
      "ham",
      "cheddar",
      "mayonnaise",
      "egg",
      "onion"
    ],
    "directions_list": [
      "mix"
    ],
    "directions_string": " Combine rice, eggs, Ham, mustard, Onion, Mayonnaise and Cheese; mix well. Season to taste. Turn into buttered shallow casserole. Bake at 350 degrees 30 minutes or until heated through.",
    "category": "brunch"
  },
  {
    "id": 5045,
    "ingredients": [
      "cream",
      "vanilla extract",
      "margarine",
      "blanched almond",
      "almond",
      "salt",
      "granulated sugar",
      "cinnamon",
      "rice",
      "light cream",
      "butter",
      "milk",
      "water",
      "vanilla",
      "sugar"
    ],
    "directions_list": [
      "heat",
      "salt",
      "cream"
    ],
    "directions_string": "Combine rice, butter, salt and 1 cup water in large saucepan. Heat to boiling, cover and cook 10 minutes. Stir in milk and cinnamon stick. Cover and cook over low heat about 45 minutes or until rice is tender, stirring occasionally. Remove cinnamon stick. Add Granulated sugar or Sugar, almond, cream and vanilla. Pour into hot serving dish. Serve with additional milk, Granulated sugar or Sugar and cinnamon, if desired.",
    "category": "brunch"
  },
  {
    "id": 5054,
    "ingredients": [
      "green bell pepper",
      "salt",
      "black pepper",
      "bacon",
      "green pepper",
      "rice",
      "pepper",
      "cheddar",
      "cheese",
      "egg",
      "onion"
    ],
    "directions_list": [
      "heat"
    ],
    "directions_string": " Cook bacon until crisp in 8-inch skillet. Remove from pan. Drain and crumble. Pour off fat and return 2 tablespoons to skillet. Add onion and green bell pepper or green pepper; cook until tender but not brown. Stir in rice and continue cooking until rice is hot. Add salt, pepper, cheese and bacon. Mix well. Make four indentations in rice mixture with back of spoon. Break an egg into each indentation. Cover and heat until eggs are of desired doneness.",
    "category": "brunch"
  },
  {
    "id": 5219,
    "ingredients": [
      "vanilla extract",
      "dried apricot",
      "cranberries",
      "pecans",
      "lemon juice",
      "raisins",
      "apricots",
      "apple",
      "apple juice",
      "brown sugar",
      "rice",
      "maple syrup",
      "water",
      "cranberry",
      "vanilla",
      "allspice"
    ],
    "directions_list": [
      "stir",
      "simmer",
      "heat",
      "top",
      "brown",
      "bake",
      "boil",
      "juice"
    ],
    "directions_string": " Combine rice, water and apple juice in 2- to 3-quart saucepan. Bring to a boil over high heat; stir once or twice.  Reduce heat to low; cover and simmer 15 minutes or until rice is tender and liquid is absorbed. Set aside.  Core Apples leaving 1-1/2-inch walls and bottoms intact; set aside. Peel top halves, if desired.  Combine rice, Raisins, cranberry or cranberries, apricots, pecans, syrup, brown sugar, lemon juice, allspice and vanilla in large bowl.  Stuff Apples with rice mixture and place in shallow glass baking dish. Place remaining rice mixture around Apples.  Cover with foil; bake at 350 degrees 50 to 60 minutes or until Apples are fork-tender",
    "category": "brunch"
  },
  {
    "id": 5416,
    "ingredients": [
      "black pepper",
      "margarine",
      "egg",
      "salt",
      "pepper",
      "mozzarella",
      "buttermilk",
      "rice",
      "tomato",
      "butter",
      "onion",
      "spinach",
      "cottage cheese"
    ],
    "directions_list": [
      "sprinkle",
      "bake"
    ],
    "directions_string": " Cook onion in butter until tender. Add spinach; cook about 1 minute. Remove from heat. Blend in buttermilk, cottage cheese, rice, salt, pepper and eggs. Turn into buttered shallow 2-quart casserole. Bake at 350 °F for 25 minutes. Arrange tomato slices on top; sprinkle with cheese. Return to oven and bake 10 minutes longer.",
    "category": "brunch"
  },
  {
    "id": 5511,
    "ingredients": [
      "salt",
      "cabbage",
      "black pepper",
      "rice",
      "pepper",
      "cornstarch",
      "chicken broth",
      "onion"
    ],
    "directions_list": [
      "brown",
      "pour",
      "salt"
    ],
    "directions_string": "Combine cabbage, Onion, rice and shrimp. Add salt, pepper and soy sauce to eggs. Stir into cabbage mixture. For each pancake pour 1/4 cup mixture onto lightly greased griddle. Cook until brown on each side, turning only once. Serve with Oriental SauceOriental Sauce: Blend chicken broth and cornstarch. Cook until thickened. Stir in soy sauce, salt and pepper.",
    "category": "brunch"
  },
  {
    "id": 5520,
    "ingredients": [
      "black pepper",
      "tomato juice",
      "oregano",
      "green peas",
      "salt",
      "oil",
      "shrimp",
      "peas",
      "pepper",
      "garden pea",
      "olive oil",
      "rice",
      "garlic",
      "onion",
      "chicken",
      "vegetable oil"
    ],
    "directions_list": [
      "oil",
      "blend",
      "juice"
    ],
    "directions_string": " Heat garlic with oil in a large, heavy skillet over medium-high heat. Add chicken and brown; push to one side. Cook onion in pan until tender. Stir or blend in peas, oregano, salt, pepper and tomato juice or tomato sauce); simmer, covered 15 to 20 minutes. Add shrimp and cook 10 minutes longer. Spoon rice around edges of 6 individual casseroles; fill centers with chicken mixture. Bake for 5 minutes at 150 °C. Serve hot and plain or over white rice.",
    "category": "dinner"
  },
  {
    "id": 5531,
    "ingredients": [
      "milk",
      "brown sugar",
      "cinnamon",
      "rice",
      "peach"
    ],
    "directions_list": [
      "brown",
      "heat",
      "stir",
      "juice"
    ],
    "directions_string": " Drain peaches, reserve juice. Cut peaches into chunks; set aside. Serve hot.  Combine rice in medium-size saucepan with reserved juice from peaches, heat over medium heat until liquid is absorbed.  Add 3/4 cup milk, continue cooking until thick and creamy. Add brown sugar and cinnamon; stir until combined. Fold in peaches.",
    "category": "brunch"
  },
  {
    "id": 5539,
    "ingredients": [
      "milk",
      "flour",
      "cheese",
      "salt",
      "sausage",
      "rice",
      "cheddar",
      "egg"
    ],
    "directions_list": [
      "stir"
    ],
    "directions_string": " Cook Sausage in medium skillet until well browned; stir to crumble. Pour off fat. Add rice, chiles and 1 cup Cheese. Spoon into 2-quart baking dish.  Blend milk, eggs, flour and salt. Pour over rice mixture. Bake at 350 degrees 1 hour, or until set.  Sprinkle with remaining 1/2 cup Cheese. Allow to stand 5 minutes before serving.",
    "category": "brunch"
  },
  {
    "id": 5593,
    "ingredients": [
      "brown rice",
      "milk",
      "yogurt",
      "brown sugar",
      "cinnamon",
      "vanilla",
      "raisins",
      "vanilla extract",
      "rice"
    ],
    "directions_list": [
      "brown",
      "heat",
      "skim"
    ],
    "directions_string": " Combine rice, skim milk, brown sugar and cinnamon in 2-1/2 to 3-quart saucepan; heat over medium heat, stirring, 10 to 12 minutes or until mixture thickens.  Stir in whole milk, Raisins and vanilla. Cook 5 more minutes, stirring until mixture thickens slightly. Place cereal into serving bowls. Sprinkle with fruit.  Top each serving with 2 tablespoons granola and yogurt, if desired.",
    "category": "brunch"
  },
  {
    "id": 5594,
    "ingredients": [
      "vanilla extract",
      "unsalted butter",
      "flour",
      "all-purpose flour",
      "salt",
      "pecans",
      "granulated sugar",
      "cinnamon",
      "brandy",
      "rice",
      "egg yolk",
      "butter",
      "milk",
      "baking powder",
      "water",
      "vanilla",
      "sugar"
    ],
    "directions_list": [
      "stir",
      "salt",
      "heat",
      "melt",
      "turn",
      "top",
      "brown",
      "beat"
    ],
    "directions_string": " Caramel Syrup: Heat Granulated sugar or Sugar in medium skillet over medium heat until it begins to melt and turn golden, 10 to 12 minutes.  Continue to cook, stirring constantly, until Granulated sugar or Sugar caramelizes. Carefully stir in water; stir to dissolve lumps. Remove from heat and add vanilla. Set aside.  Praline Pancakes: Combine milk, butter, egg yolks, brandy, vanilla, flour, Granulated sugar or Sugar, baking powder, salt and cinnamon in large bowl; beat well.  Stir in rice and pecans. Pour 2 tablespoons batter for each pancake into greased griddle or skillet. Cook until top is bubbly and underside is lightly browned, about 1 minute.  Turn pancakes and lightly brown other side. Serve warm, drizzled with Caramel Syrup.",
    "category": "brunch"
  },
  {
    "id": 5633,
    "ingredients": [
      "water",
      "sugar",
      "granulated sugar",
      "vanilla extract",
      "strawberries",
      "rice",
      "vanilla",
      "medium-grain rice",
      "raspberries"
    ],
    "directions_list": [
      "combine",
      "heat",
      "stir"
    ],
    "directions_string": " Heat water in 2-quart saucepan over medium heat until it comes to a simmer. Reduce heat to low and keep warm. Meanwhile, combine rice, half-and-half, granulated sugar or sugar and vanilla in large saucepan over medium heat; cook 1 minutes. Increase heat to medium-high; stir in 1 cup water. Cook uncovered, stirring frequently, until water is absorbed. Continue stirring and adding water, 1 cup at a time, allowing each cup to be absorbed before adding another. Cook until rice is tender and mixture has a creamy consistency, approximately 25 to 30 minutes. Serve immediately.",
    "category": "brunch"
  },
  {
    "id": 5644,
    "ingredients": [
      "baking soda",
      "egg",
      "ginger root",
      "flour",
      "all-purpose flour",
      "cooking spray",
      "granulated sugar",
      "ginger",
      "cinnamon",
      "blueberries",
      "buttermilk",
      "rice",
      "maple syrup",
      "brown rice",
      "fresh ginger",
      "baking powder",
      "sugar"
    ],
    "directions_list": [
      "warm",
      "simmer",
      "heat",
      "top",
      "brown"
    ],
    "directions_string": " Combine flour, Granulated sugar or Sugar, baking powder, baking soda and cinnamon in large bowl.  Combine egg and buttermilk in small bowl; add to flour mixture. Stir until smooth. Add rice and blueberries.  Pour 1/4 cup batter onto hot griddle coated with cooking spray. Cook over medium heat until bubbles form on top and bottom is lightly browned. Turn to brown other side.  Combine syrup and ginger in small saucepan; simmer over medium heat 10 minutes.  Remove from heat and strain; discarding ginger or ginger root. Serve warm with pancakes.",
    "category": "brunch"
  },
  {
    "id": 5660,
    "ingredients": [
      "flour",
      "rice flour",
      "salt",
      "baking powder",
      "buttermilk",
      "baking soda",
      "egg",
      "butter",
      "vegetable oil"
    ],
    "directions_list": [
      "brown",
      "beat"
    ],
    "directions_string": " Sift together rice flour, baking powder, baking soda and salt.  Combine buttermilk and eggs; add to flour mixture and beat just until blended. Bake on lightly greased hot griddle. Cook until bubbles form. Turn and brown other side.",
    "category": "brunch"
  },
  {
    "id": 5661,
    "ingredients": [
      "baking soda",
      "egg white",
      "egg",
      "flour",
      "all-purpose flour",
      "salt",
      "oil",
      "granulated sugar",
      "buttermilk",
      "rice",
      "egg yolk",
      "maple syrup",
      "baking powder",
      "sugar",
      "vegetable oil"
    ],
    "directions_list": [
      "warm",
      "stir",
      "fold",
      "dry"
    ],
    "directions_string": " Beat egg whites with Granulated sugar or Sugar until stiff but not dry in small mixer bowl; set aside.  Beat egg yolks until thick and lemon-colored in large mixer bowl. Add buttermilk and oil; beat.  Sift together flour, baking powder, baking soda and salt; stir into egg yolk mixture. Beat only until smooth.  Stir in rice; fold in egg whites. Bake in hot waffle iron until steaming stops and waffle is golden brown. Serve with warm maple syrup.",
    "category": "brunch"
  },
  {
    "id": 5662,
    "ingredients": [
      "cream cheese",
      "rice"
    ],
    "directions_list": [
      "cream"
    ],
    "directions_string": " Top rice cakes with cream cheese, then with preserves.",
    "category": "brunch"
  },
  {
    "id": 5663,
    "ingredients": [
      "peanut butter",
      "bananas",
      "rice",
      "banana",
      "peanut butter"
    ],
    "directions_list": [],
    "directions_string": " Top rice cakes with Peanut butter and sliced bananas.",
    "category": "brunch"
  },
  {
    "id": 5677,
    "ingredients": [
      "orange peel",
      "baking soda",
      "margarine",
      "egg",
      "flour",
      "salt",
      "lemon juice",
      "oil",
      "granulated sugar",
      "honey",
      "buttermilk",
      "rice",
      "orange",
      "butter",
      "milk",
      "baking powder",
      "orange juice",
      "sugar"
    ],
    "directions_list": [
      "salt",
      "brown",
      "dry",
      "top",
      "pour",
      "mix",
      "beat",
      "juice"
    ],
    "directions_string": " Sift together flour, baking powder, baking soda, salt and Granulated sugar or Sugar. Beat eggs until light. Add milk and butter; mix well.  Stir in dry ingredients; beat only until smooth. Add rice. Spoon or pour onto hot griddle, using about 1 tablespoon batter for each cake.  Cook until bubbles form on top and underside is nicely browned. Turn and brown other side. Turn only once. Serve with syrup or orange honey butter.  orange honey butter: Combine butter, honey, orange juice and lemon juice in saucepan. Heat.",
    "category": "brunch"
  },
  {
    "id": 5757,
    "ingredients": [
      "quinoa",
      "grains",
      "belgian endive",
      "pecans",
      "cherry",
      "artichoke",
      "endive",
      "shallot",
      "cherry tomato",
      "water",
      "grape tomatoes"
    ],
    "directions_list": [
      "combine",
      "stir",
      "garnish",
      "heat",
      "separate",
      "drain",
      "boil",
      "layer"
    ],
    "directions_string": " Heat large skillet over medium, and dry-roast pecans, stirring continuously to prevent scorching, until fragrant and slightly browned. Remove from heat and set aside to cool. Combine quinoa with 2½ cups water in large saucepan, and bring to a boil over medium. Reduce heat to medium-low and continue cooking grains, stirring occasionally, until tender, for 15 to 20 minutes. Scoop quinoa into strainer, rinse under cold water, drain well and set aside. Meanwhile, layer dinner plates with endive leaves. In separate mixing bowl, combine artichoke hearts, cherry tomatoes and sliced shallots. When quinoa is cool, stir grain and vegetables together, and dress as desired, tossing to combine. Arrange mixture on endive leaves, garnish with toasted pecans and serve.",
    "category": "dinner"
  },
  {
    "id": 5932,
    "ingredients": [
      "mint",
      "yogurt",
      "granulated sugar",
      "pineapple",
      "sugar"
    ],
    "directions_list": [
      "can",
      "peel",
      "skin"
    ],
    "directions_string": "Purchase a pineapple that smells fresh, with leaves that can easily be removed. Cut both ends off and peel skin with knife, removing any black bits.",
    "category": "dinner"
  },
  {
    "id": 6068,
    "ingredients": [
      "brown sugar",
      "vermouth",
      "sour cream",
      "granulated sugar",
      "strawberries",
      "sugar",
      "strawberry",
      "margarine",
      "strawberry preserves",
      "egg",
      "butter",
      "sweet vermouth"
    ],
    "directions_list": [
      "sprinkle",
      "cream"
    ],
    "directions_string": " Toss sliced strawberries with preserves and granulated sugar or sugar to coat; set aside. Heat an 8-inch omelet pan over medium high heat. Add butter or margarine, heating until bubbly. Pour in eggs; cook until set on the bottom but still moist, lifting edges gently with rubber spatula and rotating pan to let uncooked eggs run under. Spoon strawberry mixture over half of the eggs. Cook until eggs fluff. Remove from pan; sprinkle with vermouth. Fold in half to enclose filling; slide onto serving plate. Top with sour cream and whole strawberry.",
    "category": "brunch"
  },
  {
    "id": 6069,
    "ingredients": [
      "mint",
      "cheese",
      "cream cheese",
      "strawberries",
      "honey",
      "orange"
    ],
    "directions_list": [
      "peel",
      "brown",
      "blend",
      "cool",
      "roll",
      "grate",
      "beat"
    ],
    "directions_string": "Preheat oven to 400 degrees. Stack 2 biscuits; roll out to a circle about 6 inches in diameter, 1/8 inch thick. Place on ungreased baking sheet. Prick all over with fork. Repeat with remaining biscuits to make total of 5 circles. Bake until lightly browned for 6 to 8 minutes. Loosen biscuits and cool slightly. Meanwhile, finely grate peel from orange. In bowl beat Cheese, peel and 2 teaspoons of the honey to blend thoroughly; set aside. Juice orange into another bowl. Add strawberries and the remaining 2 teaspoons of honey; toss. Increase oven temperature to 425 degrees. Spread biscuits with Cheese mixture to within 1/2 inch of edges, dividing equally. Bake just until edges of Cheese brown lightly. Top with drained strawberries. Garnish with mint sprigs. Serve immediately. Yield: 5 servings.=== Other Links ===== See also ==",
    "category": "breakfast"
  },
  {
    "id": 6319,
    "ingredients": [
      "milk",
      "flour",
      "all-purpose flour",
      "salt",
      "baking powder",
      "oil",
      "canola oil",
      "sugar",
      "granulated sugar",
      "whole wheat flour",
      "egg",
      "vegetable oil"
    ],
    "directions_list": [
      "heat"
    ],
    "directions_string": "=== Rhubarb sauce === Combine rhubarb and granulated sugar or sugar in a saucepan, and cook over medium-low heat until rhubarb is tender and translucent, about 15 minutes. Using a slotted spoon, transfer about 1 cup of rhubarb to a small bowl, and reserve for waffle batter. Increase heat to medium, and cook remaining rhubarb in syrup, stirring occasionally, until slightly thickened, for about 5 minutes.",
    "category": "brunch"
  },
  {
    "id": 6611,
    "ingredients": [
      "red bell pepper",
      "salsa",
      "corn",
      "oil",
      "kidney bean",
      "sweet pepper",
      "olive oil",
      "lentils",
      "rice",
      "tomato",
      "garlic",
      "chili powder",
      "onion",
      "water"
    ],
    "directions_list": [
      "simmer",
      "oil",
      "heat"
    ],
    "directions_string": " In a large saucepan, heat oil over medium heat. Cook the onion for 5 minutes or until tender but not browned. Add kidney bean or beans, stock, rice, corn, salsa, lentils, sweet pepper, chili powder, and garlic. Bring to a boil. Reduce heat, cover and simmer for 20-25 minutes or until rice and lentils are tender and most of the liquid is absorbed. Serve over tomato slices.",
    "category": "dinner"
  },
  {
    "id": 6661,
    "ingredients": [
      "sugar",
      "granulated sugar",
      "gelatin",
      "margarine",
      "egg",
      "flour",
      "salt",
      "castor sugar",
      "fresh yeast",
      "yeast",
      "cinnamon",
      "sultanas",
      "superfine sugar",
      "mixed spice",
      "milk",
      "water",
      "golden raisin",
      "plain flour",
      "allspice"
    ],
    "directions_list": [
      "combine",
      "warm",
      "rise",
      "salt",
      "knead",
      "skim",
      "dough"
    ],
    "directions_string": " In a bowl, combine yeast with 1 tablespoon of the granulated sugar or sugar, and the warmed skim milk. Stir until the yeast and granulated sugar or sugar are totally dissolved. Cover and stand in a warm place for 10 minutes, until bubbly. In another bowl, combine remaining granulated sugar or sugar with flour, salt and spices. Massage in margarine, then include the yeast and milk mixture, egg and golden raisin or sultanas. Mix well, cover the bowl, and let mixture rise for 30 minutes in a warm place. Transfer dough to a floured surface and knead until smooth. Divide the dough into 16 pieces and knead pieces into round shapes. Place buns into a well-greased, 25 cm / 10 inch - square cake tin. Let rise in a warm place for 10 minutes.",
    "category": "breakfast"
  },
  {
    "id": 6682,
    "ingredients": [
      "chicken",
      "cheese",
      "bacon",
      "sausage",
      "ham",
      "pork",
      "egg",
      "potato"
    ],
    "directions_list": [],
    "directions_string": "On a plate, place two pieces of toast.",
    "category": "lunch"
  },
  {
    "id": 6708,
    "ingredients": [
      "walnuts",
      "breadcrumbs",
      "egg",
      "oil",
      "garlic",
      "feta",
      "spinach",
      "cheese",
      "chicken"
    ],
    "directions_list": [
      "brown",
      "oil",
      "top"
    ],
    "directions_string": " Pulse on your small food processor or processor attachment on a blender, then fill the food processor to the top with washed and dried spinach leaves and pulse until blended twice. Add ½ cup crumbled feta cheese, and basil leaves, and pulse until it is a thick paste. Pound the chicken breasts, thighs, or legs with the tenderizer until only thin, but not torn, and spread 1-2 tablespoons of pesto on middle of breast half. Roll into the plastic wrap square for each breast, thigh, or leg and refrigerate for at least 1 hour. Then dredge in 1 beaten egg and coat with seasoned breadcrumbs. Fry in ½ cup hot oil on both sides until golden brown (about 7 minutes). Bake in a heated oven at 350° F, uncovered about 35 minutes until the chicken is 160° C or opaque in the middle. Let rest while you set the table and light the candles, or make a hollandaise sauce. Serve hot and plain with the homemade pesto.",
    "category": "dinner"
  },
  {
    "id": 6933,
    "ingredients": [
      "french bread",
      "powdered sugar",
      "cream",
      "sugar",
      "granulated sugar",
      "egg",
      "light whipping cream",
      "cinnamon",
      "nutmeg",
      "butter",
      "orange juice",
      "whipping cream"
    ],
    "directions_list": [
      "combine",
      "whisk",
      "bread"
    ],
    "directions_string": " Cut loaf ends from bread/reserve. Cut remaining loaf into 1½ inch thick slices and let stand uncovered, 4 hours to overnight. In 9x13\" pan, combine orange juice, cream, eggs, cinnamon, granulated sugar or sugar and nutmeg. With a wire whip, whisk until well blended. Lay bread in pan. Turn several times until all liquid is absorbed, 3–5 minutes. Melt butter in 12\" to 14\" frying pan over medium heat. Put soaked bread into frying pan. Cook, turning as needed, until richly browned on both sides (5 minutes). Dust with powdered sugar;.",
    "category": "brunch"
  },
  {
    "id": 6985,
    "ingredients": [
      "lettuce",
      "black pepper",
      "cilantro",
      "curry powder",
      "chile",
      "white rice",
      "salt",
      "lemon juice",
      "oil",
      "shrimp",
      "tomato sauce",
      "hass avocado",
      "mango",
      "tomato",
      "garlic",
      "chile pepper",
      "coconut milk",
      "onion",
      "milk",
      "curry",
      "california avocados",
      "red onion",
      "vegetable oil"
    ],
    "directions_list": [
      "stir",
      "salt",
      "serve",
      "oil",
      "shell",
      "sprinkle",
      "skin"
    ],
    "directions_string": " Cut the mangoes in halves and skin them in such a way so you reserve half shell of the skin intact as much as possible to serve the dish in them. Prepare the ingredients as listed above. Marinate the shrimp in lemon juice, add a dash of black pepper and salt for 10 minutes. Heat oil in a saucepan under medium heat. Put in the chopped garlic and the sliced onions and stir for 4 minutes. Put in the shrimp and the curry powder, dash of black pepper and stir for 2 minutes. Stir in the Hass avocado or California avocados and the green/red chopped chile in it and stir for 2 minutes - the shrimps should pink now. Add the soy sauce and the tomato sauce and stir for a few seconds. Add the coconut milk and stir in the mangoes. Add a dash of salt now as needed. Heat through till the milk absorbs and the dish is mixed through. Arrange a platter with chopped lettuce. Divide the portion of the mixture in each of those left mango skin shells and sprinkle a dash of the fresh chopped cilantro on top. Place the shells (one on each plate) on the center and serve hot immediately. Best if served with plain white rice.",
    "category": "dinner"
  },
  {
    "id": 7071,
    "ingredients": [
      "oregano",
      "lemon",
      "salt",
      "olive oil",
      "parsley",
      "sea salt",
      "garlic",
      "basil",
      "chicken"
    ],
    "directions_list": [],
    "directions_string": " Cut peeled potatoes into 4 to 6 parts, grate carrots coarsely and cook together in a small amount of water. Cut cabbage into squares. According to taste, flour and egg may be made into a dough which is then chopped into small pieces and added to the soup when the vegetables are cooked. Bring to a boil again so that the dumplings will cook. Add the butter and milk, being careful not to let soup boil.",
    "category": "dinner"
  },
  {
    "id": 7088,
    "ingredients": [
      "sugar",
      "granulated sugar",
      "margarine",
      "egg",
      "granulated sugar",
      "onion",
      "cardamom",
      "saffron",
      "butter",
      "onion",
      "vermicelli",
      "water",
      "sugar",
      "coconut"
    ],
    "directions_list": [
      "saute",
      "heat",
      "separate",
      "thin",
      "top",
      "boil"
    ],
    "directions_string": " Saute the chopped Onion in 2 Tablespoons of butter until lightly browned.  Remove the onions from the saute pan and place in a bowl on the side.  Scramble the eggs in the saute pan by frying them while constantly stirring them (so that the eggs are cooked in small pieces).  In a separate sauce pan, bring water to boil and add the vermicelli.  Cook until the vermicelli is just tender.  You want the vermicelli to be firm (yet cooked).  You do not want it to be soft and smashed together. This thin vermicelli goes from the \"just cooked\" phase to the \"soft and smashed\" phase quickly so you will have to be diligent in watching it and removing it from the heat as soon as it is cooked. Drain.  In the sauce pan put the remaining 2 Tablespoons of butter, the cardamom, saffron, Granulated sugar or Sugar, cooked onions and eggs, and coconut. On top of all this, add the cooked vermicelli.  Return to the heat (med-low heat) and cook while stirring for one minute.  Serve warm.",
    "category": "brunch"
  },
  {
    "id": 7132,
    "ingredients": [
      "cilantro",
      "salt",
      "oil",
      "chilli powder",
      "peas",
      "onion",
      "ginger",
      "tomato",
      "garlic",
      "water",
      "chicken",
      "vegetable oil"
    ],
    "directions_list": [
      "oil",
      "heat",
      "boil"
    ],
    "directions_string": " Cut chicken into very small pieces about the size of peas (remove or leave bones as desired). Place in a saucepan and add water and 4 tablespoons oil and bring to a boil. Add garlic, salt, green chilies, tomatoes, curry powder (optional), and ginger to taste. Lower heat slightly and boil for another 5-10 minutes, stirring occasionally. The dish should have some liquid while hot. Serve plain with other other dishes. Garnish with cicely, cilantro, peas, and chili leaves, if desired.",
    "category": "dinner"
  },
  {
    "id": 7488,
    "ingredients": [
      "margarine",
      "egg",
      "salt",
      "pepper",
      "butter"
    ],
    "directions_list": [
      "warm",
      "salt",
      "can",
      "season",
      "fold"
    ],
    "directions_string": " Fry the chorizo up in butter. In a large bowl, add 3 eggs. Beat 3 eggs with a fork and season with salt and pepper. Beat until the eggs can pass through the fork without sticking to it. Melt the fat or butter in a hot frying pan. Pour on the eggs. Stir with a fork, at the same time shaking the pan, until the eggs start to set, carefully lifting the edges of the omelet to allow the uncooked portion to run underneath to be cooked. Add the fried chorizo. When the eggs are set, fold over and cook until eggs are cooked through. Serve warm and plain over white rice.",
    "category": "dinner"
  },
  {
    "id": 7504,
    "ingredients": [
      "celery",
      "lemon",
      "salt",
      "bay leaves",
      "lemon juice",
      "white wine",
      "parsley",
      "onion",
      "water",
      "bay leaf",
      "carrot"
    ],
    "directions_list": [
      "simmer",
      "warm",
      "heat",
      "salt"
    ],
    "directions_string": " Cut the salmon fillets into individual portions with the chef's knife. Place in a large skillet the carrot, onion, sliced celery, lemon, parsley, and bay leaf or bay leaves. Add the cold water to cover, salt to taste, the wine, and the lemon juice. Bring the water to a boil, uncovered. Adjust heat to simmer and let cook for 5 minutes. Turn off the heat and leave undisturbed for 10 minutes. Then remove it carefully to a serving platter; the salmon will be perfectly done. Serve warm and plain or with any seafood.",
    "category": "dinner"
  },
  {
    "id": 7555,
    "ingredients": [
      "brandy"
    ],
    "directions_list": [],
    "directions_string": "1.Pour Golden Grain into lower ",
    "category": "breakfast"
  },
  {
    "id": 7556,
    "ingredients": [
      "advocaat",
      "sausage"
    ],
    "directions_list": [],
    "directions_string": "1.Mix eggs,milk,and Advocaat in measuring cup;beat until foamy.",
    "category": "brunch"
  },
  {
    "id": 7603,
    "ingredients": [
      "milk",
      "cinnamon",
      "sugar",
      "granulated sugar",
      "vanilla extract",
      "vanilla",
      "strawberries",
      "margarine",
      "egg",
      "butter"
    ],
    "directions_list": [
      "whisk",
      "garnish",
      "soak",
      "melt",
      "sprinkle",
      "brown",
      "mix"
    ],
    "directions_string": " In a pie plate, mix granulated sugar or sugar and cinnamon; whisk in eggs, milk and vanilla. Cut croissants in half horizontally; place in egg mixture. Let soak a few minutes. In skillet, melt butter over medium-high heat. Add croissants; brown on both sides. Serve immediately; if Desired, sprinkle with confectioners' sugar and garnish with fresh strawberries.",
    "category": "brunch"
  },
  {
    "id": 7641,
    "ingredients": [
      "cheddar",
      "salt",
      "ham",
      "black pepper",
      "water",
      "sour cream",
      "cheese",
      "egg",
      "butter"
    ],
    "directions_list": [
      "melt",
      "salt",
      "beat"
    ],
    "directions_string": " In a medium size bowl, beat eggs, sour cream, water, and salt and pepper until fluffy. Using a nonstick frying pan, melt butter and cook eggs over low heat, stirring occasionally. Stir in the cheese. Cook until you reach desired consistency. Serve hot with country ham and biscuits.",
    "category": "brunch"
  },
  {
    "id": 7787,
    "ingredients": [
      "sausage",
      "bread",
      "sausage",
      "egg",
      "rosemary",
      "salt",
      "thyme",
      "pepper",
      "apple",
      "sage",
      "butter",
      "chicken"
    ],
    "directions_list": [],
    "directions_string": " Preheat oven to 350°F. Boil cauliflower until tender. Drain. Using a hand mixer, beat cauliflower and cream for 2 – 3 minutes. Add parsley, chives, egg yolk, salt, and pepper. Beat with mixer until well blended. Coat the bottom of an 8x8 inch baking pan with non-stick spray. Place egg white and cream of tartar in mixing bowl and whip on high speed for 3-4 minutes or until stiff. Fold egg white mixture into cauliflower. Cut salmon filet into 2 x 6-ounce pieces and place skin side down into the bake pan. Sprinkle with lemon juice and add salt and pepper. Spread cauliflower mixture over the salmon and then pour over the salmon. Then, pour the ½ cup melted butter and chicken broth over the top. Bake at 350°F for 30 – 40 minutes or until done.",
    "category": "dinner"
  },
  {
    "id": 7801,
    "ingredients": [
      "salt",
      "cornmeal",
      "bacon",
      "sausage"
    ],
    "directions_list": [
      "dip",
      "stir",
      "fry"
    ],
    "directions_string": " Moisten the cornmeal with a little water and stir into the boiling water. Cook over a low heat, for 45 minutes, stirring often. Most of the cornmeal sold today has been processed to cook much faster, so follow the directions. Pour the hot cornmeal into a greased (I use a \"Pam\" type product) loaf pan or glass baking dish and let stand, uncovered, until cold and firm. (Can be refrigerated over night) Cut into slices, dip in flour and fry in hot fat until browned.",
    "category": "breakfast"
  },
  {
    "id": 7807,
    "ingredients": [
      "whipped cream",
      "cinnamon",
      "canola oil",
      "bread",
      "vanilla extract",
      "egg",
      "banana",
      "challah"
    ],
    "directions_list": [
      "oil",
      "beat",
      "bread"
    ],
    "directions_string": " Lightly beat eggs in a shallow dish or pie pan. Whisk in cinnamon and vanilla extract. Dip slices of bread into the egg mixture, coating both sides. Pour a generous amount of Honey Bunches of Oats™ cereal into another pie pan or shallow dish. Press slices of bread into the cereal on both sides so that cereal sticks. Cook bread slices in a hot skillet with a little canola oil until golden. Garnish with banana slices and whipped cream. Enjoy.",
    "category": "brunch"
  },
  {
    "id": 7808,
    "ingredients": [
      "cheddar",
      "bacon",
      "sausage",
      "egg",
      "green onions",
      "green bell pepper",
      "green pepper",
      "cheese"
    ],
    "directions_list": [],
    "directions_string": " Lightly beat eggs in a shallow dish or pie pan. Whisk in cinnamon and vanilla extract. Dip slices of bread into the egg mixture, coating both sides. Pour a generous amount of Honey Bunches of Oats™ cereal into another pie pan or shallow dish. Press slices of bread into the cereal on both sides so that cereal sticks. Cook bread slices in a hot skillet with a little canola oil until golden. Garnish with banana slices and whipped cream. Enjoy.",
    "category": "brunch"
  },
  {
    "id": 7930,
    "ingredients": [
      "cheddar",
      "sour cream",
      "jack cheese",
      "egg"
    ],
    "directions_list": [
      "sprinkle",
      "mix"
    ],
    "directions_string": " Pour picante sauce into spray coated 10 in pie pan. sprinkle with cheeses set aside. In blender or food processor mix eggs and sour cream. Pour over cheeses. Bake at 375 °F for 20–25 minutes.",
    "category": "brunch"
  },
  {
    "id": 7951,
    "ingredients": [
      "paprika",
      "chicken broth",
      "salt",
      "sour cream",
      "pepper",
      "onion",
      "chicken"
    ],
    "directions_list": [
      "trim",
      "stir",
      "mix",
      "drizzle"
    ],
    "directions_string": " Wash chicken pieces and trim off excess skin. Rub all over with salt, pepper and paprika. Place in a slow cooker. Scatter onion over chicken. Pour in chicken broth. Cover tightly and cook on high setting for 30 minutes. Turn to low setting and continue cooking for 6 to 7 hours, or until chicken is tender. Just before serving, stir in or mix with the sour cream. Garnish with the parsley and drizzle with the hot sauce, if desired.",
    "category": "dinner"
  },
  {
    "id": 8050,
    "ingredients": [
      "flour",
      "salt",
      "lard",
      "cinnamon",
      "sugar",
      "baking soda",
      "shortening",
      "molasses",
      "ginger",
      "butter",
      "cloves"
    ],
    "directions_list": [
      "stir",
      "cream",
      "brown",
      "dry",
      "pour",
      "bake",
      "mix"
    ],
    "directions_string": " Cream together the butter, shortening or lard (lard was used in the authentic recipes), and sugar. Beat the eggs well, and stir into the butter mixture, along with the molasses. Sift the dry ingredients together onto a sheet of wax paper; pour into butter mixture, mix lightly. Add hot water. Beat hard to make a smooth batter. Cook in pre-heated waffle iron and bake 3 – 5 minutes, or until waffle is done to the desired color and steaming stops. Serve with vanilla flavored whipped cream or brown sugar sauce.",
    "category": "brunch"
  },
  {
    "id": 8098,
    "ingredients": [
      "milk",
      "cocoa",
      "pecans",
      "powdered sugar",
      "water",
      "vanilla extract",
      "margarine",
      "butter"
    ],
    "directions_list": [
      "roll",
      "top",
      "glaze",
      "dough",
      "beat"
    ],
    "directions_string": " Heat oven to 375°F. Separate crescent dough into 16 triangles. Beat butter in small bowl until creamy. Gradually add powdered sugar, beating until well blended. Beat in milk and vanilla. Add cocoa; beat well. Stir in pecans. Spread slightly heaping teaspoon chocolate mixture on each triangle within ½ inch of edges. Roll up; start at shortest side of triangle and roll to opposite point. Press all edges to seal completely. Place point side down on ungreased cookie sheet; curve slightly to form crescents. Bake 12 to 15 minutes or until golden brown. Remove from cookie sheet to wire rack. Cool to room temperature. Drizzle chocolate glaze over top of crescents. ",
    "category": "breakfast"
  },
  {
    "id": 8167,
    "ingredients": [
      "black pepper",
      "asparagus",
      "bacon"
    ],
    "directions_list": [],
    "directions_string": " Puree ¾ cup corn and milk in food processor until smooth, add scallions and pulse until finely chopped. Add ricotta and next 6 ingredients, pulse until combined. Transfer batter to a bowl, stir in remaining corn. Heat oven to 225°F. Place a baking sheet in oven. Coat 2 skillets with cooking spray and heat. Drop teaspoonfuls of batter into the hot skillets. Cook 2½ minutes per side or until puffed and golden. Transfer to oven to keep warm while making remaining corn cakes. To serve, arrange warm fritters on a platter and serve with sauces. ",
    "category": "dinner"
  },
  {
    "id": 8191,
    "ingredients": [
      "black pepper",
      "sugar",
      "red cabbage",
      "cider vinegar",
      "chicken",
      "mayonnaise",
      "milk"
    ],
    "directions_list": [],
    "directions_string": " In a large bowl mix all ingredients. Pour into prepared pans or bundt pan. Bake in 350°F oven for 30 – 35 minutes or until cake springs back. Cool. Frost if desired with whipped cream.",
    "category": "dinner"
  },
  {
    "id": 8367,
    "ingredients": [
      "milk",
      "salt",
      "cinnamon",
      "nutmeg",
      "almond extract",
      "vanilla extract",
      "butter"
    ],
    "directions_list": [],
    "directions_string": " In a bowl, mix together tomato, onion, jalapeno and cilantro, set aside. Add lime juice and zest, oil and salt to tomato mixture, stir to combine. Score each half of the avocado flesh into a small dice and scoop out, fold into tomato mixture. Press plastic wrap onto the surface and refrigerate. Stir before serving. Serve with tortilla chips. ",
    "category": "breakfast"
  },
  {
    "id": 8560,
    "ingredients": [
      "salmon",
      "salt",
      "green onions",
      "red pepper flakes",
      "canola oil",
      "lime juice",
      "scallions"
    ],
    "directions_list": [
      "salt",
      "serve",
      "can",
      "oil",
      "heat",
      "brush",
      "microwave",
      "glaze",
      "layer"
    ],
    "directions_string": " Preheat the oven to 425° F. Wrap the foil around the handle of the skillet if it is never ovenproof. Combine the fruit spread, lime juice, scallions and red pepper flakes in a bowl, stirring until the jelly is dissolved. (You can microwave it for a few seconds to make it easier to stir). Sprinkle salt over the fish. Heat the oil over medium high in a skillet large enough to hold the fish in a single layer without crowding. Cook the fish cook 3 minutes on each side, or until golden. Remove from the heat and brush the fish with most of the glaze. Place in the oven for 4 to 5 minutes, or until the salmon just turns opaque. Pour the remaining glaze over it and serve immediately.",
    "category": "dinner"
  },
  {
    "id": 8685,
    "ingredients": [
      "black pepper",
      "tarragon",
      "unsalted butter",
      "salt",
      "ham",
      "sour cream",
      "onion",
      "shallot",
      "crème fraîche"
    ],
    "directions_list": [
      "toast",
      "stir",
      "salt",
      "oil",
      "heat",
      "slice",
      "thicken",
      "dip"
    ],
    "directions_string": " Preheat oven to 350°F. Lightly oil a 12-cup muffin tin. In a large heavy frying pan over medium-high heat, sauté mushrooms and shallot in butter with salt and pepper, stirring, approximately 10 minutes or until mushrooms are tender and liquid they give off is evaporated. Remove from heat and stir in crème fraîche and tarragon. To assemble, fit 1 slice of ham into each prepared muffin cups (ends will stick up and hang over edges of cups). Divide mushrooms among cups and crack 1 egg into each. Bake in middle of oven approximately 12 to 14 minutes, depending on number of servings being baked. Check the eggs after about 10 minutes baking time. When done, the whites should be completely set and the yolks beginning to thicken but not hard. Season eggs with additional salt and pepper. Remove eggs (with ham) from muffin cups carefully, using 2 spoons or small spatulas, and place on individual serving plates. Garnish with tarragon leaves triangles of buttered toast leaned on the cups to dip in the yolk as desired. Serve two eggs per person.       ",
    "category": "brunch"
  },
  {
    "id": 8688,
    "ingredients": [
      "salt",
      "cooking spray",
      "black pepper",
      "ketchup",
      "scallions",
      "bacon",
      "hot pepper sauce",
      "egg whites"
    ],
    "directions_list": [],
    "directions_string": " Place potatoes in the oven and cook for about 1 hour at 350°F degrees. Meanwhile heat water in a large saucepan and add chopped celery to the water and simmer until celery is tender.  When potatoes are fully cooked, slice down the center and scoop the pulp out of each potato and add to celery and water.  Add milk. butter, sour cream, bacon, green onions, 1 cup of the cheddar cheese, parsley or dill and salt and pepper.  Allow mixture to simmer over low-medium heat until it thickens.  Serve hot with cheddar cheese sprinkled on top. You may also top with chives (from the top of the green onions), bacon pieces and sour cream.",
    "category": "brunch"
  },
  {
    "id": 8851,
    "ingredients": [
      "salt",
      "rosemary",
      "thyme",
      "white wine",
      "olive oil",
      "parsley",
      "rice",
      "garlic",
      "pasta",
      "wine"
    ],
    "directions_list": [
      "fry",
      "salt",
      "oil",
      "heat",
      "skin",
      "bake"
    ],
    "directions_string": " Preheat the oven to 180° C. Heat the oil and fry the chicken on moderate heat until golden brown. Add salt to taste. Remove the outer skin of the garlic. Put the chicken pieces into a baking dish and place the garlic over them. Sprinkle with the herbs. Cover the chicken with wine and bake for 1 hour. Serve hot with rice or pasta. Drizzle with the chili oil, if desired.",
    "category": "dinner"
  },
  {
    "id": 8858,
    "ingredients": [
      "milk",
      "salt",
      "sour cream",
      "pepper",
      "dill",
      "garlic",
      "potato",
      "butter"
    ],
    "directions_list": [
      "can",
      "simmer",
      "heat",
      "turn",
      "cut",
      "boil"
    ],
    "directions_string": "1) Peel and cube the taters (roughly 1 inch cubes) into a pot of cold water. Bring the taters to a boil and then turn the heat down to a high simmer (much like the sustained heat of two luvers such as N&N!) so they don't boil over. Cook them taters till they're soft but still firm to a fork. If they mush in the pot, that's overcooked, but you should be able to cut them with a fork. The object is to get a firm consistency that can take all the butter and milk and still have a few solid potato lumps to it.",
    "category": "dinner"
  },
  {
    "id": 8892,
    "ingredients": [
      "salt",
      "black pepper",
      "water",
      "parsley",
      "dill",
      "egg",
      "butter",
      "parmesan cheese"
    ],
    "directions_list": [
      "pour",
      "turn",
      "flip"
    ],
    "directions_string": " Add eggs, water, salt, pepper to small bowl. Mix items in bowl together using a fork or whisk. Add herbs or cheese (optional). Put egg mixture aside. Place small pan on stove burner. Set burner to medium. Add butter to pan. When butter begins to melt, pick up the pan by its handle and use circular motions to swirl the butter around. Place pan back on burner. Once butter is melted, pour egg mixture into pan. When egg mixture begins to solidify, use spatula to move the egg around, thus scrambling it. When desired texture is reached, turn off stove and flip eggs from the pan onto a plate.",
    "category": "breakfast"
  },
  {
    "id": 8894,
    "ingredients": [
      "milk",
      "egg",
      "shortening",
      "butter"
    ],
    "directions_list": [
      "oil"
    ],
    "directions_string": " Mix ingredients together in a bowl. Don't worry if batter is slightly lumpy: it's supposed to be that way. Cook on hot skillet which is greased with oil or butter. Flip pancakes when butter/oil bubbles appear around pancakes and edges begin to dry.",
    "category": "breakfast"
  },
  {
    "id": 8897,
    "ingredients": [
      "onion",
      "turkey",
      "salt",
      "vegetable oil"
    ],
    "directions_list": [
      "microwave",
      "mix",
      "rub"
    ],
    "directions_string": " Thaw the turkey breast. A frozen 5–6 pound breast thaws within one day in the refrigerator. It is also very important that you have purchased a frozen fully pre-cooked breast. The words \"heat and serve\" may be on the package. Preheat your oven to 350 °F. Remove turkey from bag and place in aluminum roasting pan. Spray the turkey with cooking oil. If using regular vegetable oil, rub the breast with it. Place turkey breast in the oven on the middle rack. Cook for 15 minutes. Begin the gravy mix according to package directions. Place the vegetables on the range set to low heat. Prepare the instant potatoes or stuffing according to the package directions. On a small pan lay out your frozen biscuits allowing them to touch one another. At this point the turkey breast should have been cooking for 30 minutes. Place your biscuits on the lower rack. The biscuits will cook just fine with the turkey in the oven and will be ready in 25–30 minutes. Check them at 20 minutes to be sure they do not burn. Finish preparing your instant potatoes or stuffing, instant gravy, and vegetables. Place them in serving dishes if desired. Place the cranberry sauce in a serving dish. If you are serving pie along with the dinner you will also need to place the pie on a serving dish. If a frozen pie has been purchased, follow the microwave directions. At the end of the hour, remove the turkey. It is recommended that you use a food thermometer to make sure it has achieved a temperature of 160 °F — the minimum temperature necessary to kill any bacteria which have survived the freezing process. Remove the turkey and serve.",
    "category": "dinner"
  },
  {
    "id": 8902,
    "ingredients": [
      "dried fruit",
      "rolled oats",
      "vanilla extract",
      "almond",
      "flour",
      "cranberries",
      "cherry",
      "salt",
      "raisins",
      "cherries",
      "sesame seed",
      "apricot",
      "sunflower seeds",
      "brown sugar",
      "apple juice",
      "cinnamon",
      "maple syrup",
      "water",
      "cranberry",
      "vegetable oil",
      "dried fruit"
    ],
    "directions_list": [
      "can",
      "warm",
      "mix",
      "toast"
    ],
    "directions_string": " Set oven to 350 °F. In a dry, ungreased skillet, mix the seeds together with the nuts.  Stir frequently over a low flame, until you smell a toasty, warm scent. Alternately, you can toast the nuts and seeds in a pan in a toaster oven for 2 minutes on a low setting. Combine the nuts and seeds with all other remaining ingredients (except dried Fruit or dried fruit) in a large bowl.  Spread the resulting mixture on two cookie sheets.  Bake for approximately 20 minutes or until golden, flipping the mixture often using a spatula or spoon during baking.  Take out of oven. Stir in dried fruit.  Store in an airtight container.",
    "category": "breakfast"
  },
  {
    "id": 8917,
    "ingredients": [
      "flour",
      "pumpkin",
      "salt",
      "cinnamon",
      "baking powder",
      "water",
      "nutmeg",
      "nuts",
      "sugar",
      "granulated sugar",
      "baking soda",
      "egg",
      "vegetable oil"
    ],
    "directions_list": [
      "top",
      "stir",
      "dry",
      "separate"
    ],
    "directions_string": " Preheat oven to 350°F. Combine eggs, sugar, pumpkin, oil, and water in a medium-sized mixing bowl. Stir together flour, baking soda, salt, baking powder, and spices in a separate bowl. Add dry ingredients to wet, and stir to blend. Place batter ¾ to top of non-stick or lightly oiled muffin tins. You may also use cupcake cups. Bake 20 minutes or until toothpick inserted into the middle of a muffin comes out clean. Remove from pan right away.",
    "category": "breakfast"
  },
  {
    "id": 8954,
    "ingredients": [
      "milk",
      "brown sugar",
      "egg"
    ],
    "directions_list": [
      "toast",
      "brown",
      "stir"
    ],
    "directions_string": " Beat eggs in a bowl Pour in milk and stir Add brown sugar Stir until mixture is creamy Dip Texas toast in mixture  Drop unto a hot buttered griddle. Flip from side to side Brown to desired color  Remove from griddle promptly.",
    "category": "breakfast"
  },
  {
    "id": 8998,
    "ingredients": [
      "peach",
      "ice"
    ],
    "directions_list": [
      "roll",
      "mix"
    ],
    "directions_string": " Pour peach purée then prosecco into a mixing glass filled with ice. Gently roll the shaker end over end to mix the ingredients. Do not shake as shaking will make the prosecco flat and could cause the mixing glass to explode. Strain into a champagne glass and serve.",
    "category": "brunch"
  },
  {
    "id": 9080,
    "ingredients": [
      "milk",
      "cheddar",
      "leek",
      "cauliflower",
      "mozzarella",
      "egg",
      "butter"
    ],
    "directions_list": [],
    "directions_string": "1. Preheat oven to 375º.",
    "category": "breakfast"
  },
  {
    "id": 9233,
    "ingredients": [
      "milk",
      "oil",
      "powdered milk"
    ],
    "directions_list": [
      "warm",
      "can",
      "oil",
      "blend",
      "dry",
      "brown",
      "mix"
    ],
    "directions_string": " Measure milk, dry milk, egg, and oil into blender or bowl. Beat until egg is well blended.  Add pancake mix. Stir or blend at low speed until mix is wet but some lumps remain.  Cook on hot, greased griddle or frying pan. Turn when firm to brown the other side.  These can be kept warm in a warm oven or in a covered pan on low heat. Makes seven 4\" pancakes.",
    "category": "breakfast"
  },
  {
    "id": 9234,
    "ingredients": [
      "margarine",
      "egg"
    ],
    "directions_list": [
      "turn",
      "warm",
      "mix",
      "freeze"
    ],
    "directions_string": " Put egg, soy formula, and melted margarine into bowl or blender. Beat to blend. Stir in mix until wet but some lumps remain. Cook on greased or oiled pan (use only milk-free margarine, bacon fat, or shortening) until firm enough to turn over. Brown other side. Keep warm in oven or covered pan on low heat. If you wish to freeze pancakes, follow directions in recipe for High Protein Pancakes. Makes six four-inch pancakes.",
    "category": "breakfast"
  },
  {
    "id": 9235,
    "ingredients": [
      "coffee",
      "sugar",
      "granulated sugar",
      "vanilla extract",
      "egg",
      "molasses",
      "lemon juice",
      "cinnamon",
      "ice cream",
      "milk",
      "banana"
    ],
    "directions_list": [
      "blend"
    ],
    "directions_string": " Mix or blend until smooth. Add more milk for a thinner shake. If shake tastes too sweet, add a few drops of lemon juice.",
    "category": "breakfast"
  },
  {
    "id": 9298,
    "ingredients": [
      "milk",
      "sugar",
      "granulated sugar",
      "orange juice",
      "egg",
      "vegetable oil"
    ],
    "directions_list": [
      "fry",
      "oil",
      "heat",
      "bread",
      "mix",
      "juice"
    ],
    "directions_string": " Heat oil in pan. Scramble egg, milk, juice and sugar. Dip both sides of bread into mix and fry over medium heat for 2 minutes or until done. Repeat with second piece of bread. The orange juice gives the \"toast\" a delightful flavor. Enjoy!",
    "category": "breakfast"
  },
  {
    "id": 9310,
    "ingredients": [
      "breadcrumbs",
      "worcestershire sauce",
      "pimento",
      "lemon juice",
      "parsley",
      "curry powder",
      "broccoli",
      "sour cream",
      "cheese",
      "chicken",
      "tabasco sauce",
      "mayonnaise"
    ],
    "directions_list": [
      "cool",
      "layer",
      "bread"
    ],
    "directions_string": " Cover chicken with water. Add bay leaf, celery tops, salt, and pepper. Cook. Debone chicken. Blanche broccoli and let cool on paper towels. Place chicken in buttered casserole. Add layer of broccoli and pimento strips. Mix soup, sour cream, half of cheese, curry, and parsley. Pour over chicken and broccoli. Repeat layers. Top with cheese and bread crumbs and paprika. Bake at 375 degrees for 35 to 40 minutes.",
    "category": "dinner"
  },
  {
    "id": 9429,
    "ingredients": [
      "oregano",
      "ham",
      "thyme",
      "oyster",
      "sour cream",
      "pepper",
      "italian bread",
      "parsley",
      "mozzarella",
      "garlic",
      "basil",
      "onion",
      "milk",
      "french bread",
      "mushroom",
      "egg substitute"
    ],
    "directions_list": [
      "combine",
      "garnish",
      "chill",
      "heat",
      "bread",
      "cut"
    ],
    "directions_string": " In a large skillet cook onion and garlic in hot pan sprayed with cooking spray over medium heat for 2 minutes. Add mushrooms and cook about 3 minutes more or until tender, stirring occasionally. Remove from heat. Add herbs. In a greased 2-quart square baking dish, place half of the bread cubes. Top with mushroom mixture, ham and mozzarella. In a mixing bowl combine beaten eggs or egg product, milk, sour cream, mustard, and pepper. Pour over layers in dish. Cover and chill in the refrigerator for 2 to 24 hours. Bake, uncovered, in a 325 °F oven for 55 to 60 minutes or until a knife inserted near the center comes out clean. Let stand for 10 minutes. To serve, cut into squares. If desired, garnish with fresh herb sprigs.",
    "category": "brunch"
  },
  {
    "id": 9524,
    "ingredients": [
      "flour",
      "baking powder",
      "oil",
      "raisins",
      "low-fat milk",
      "honey",
      "egg"
    ],
    "directions_list": [
      "dry",
      "beat"
    ],
    "directions_string": " Preheat oven to 400°F. Mix together the flour and baking powder. Set aside. In a large mixing bowl, beat together the milk, honey, egg, and oil. Add to dry ingredients along with bran flakes and raisins (optional). Mix together '''only''' until moistened. Portion into twelve muffin cups lightly coated with cooking spray or lined with muffin papers. Bake 25 minutes until lightly browned. Serve warm.",
    "category": "breakfast"
  },
  {
    "id": 9528,
    "ingredients": [
      "margarine",
      "macaroni",
      "pepper",
      "tuna",
      "butter",
      "milk"
    ],
    "directions_list": [],
    "directions_string": " Heat oven to 400 °F. Mix the cooked macaroni, milk, pepper, soup, drained vegetables, and tuna in a 2-quart casserole. Combine the crushed cereal and margarine or butter. Sprinkle over casserole. Bake, uncovered, for 30 minutes until bubbly around the edge. Sprinkle cheese over the top. Allow to set for 5 minutes. Serve hot and plain or with any seafood.",
    "category": "dinner"
  },
  {
    "id": 9539,
    "ingredients": [
      "yogurt",
      "nutmeg",
      "vanilla extract",
      "banana",
      "peanut butter",
      "pineapple juice"
    ],
    "directions_list": [],
    "directions_string": "1.Combine all ingredients, except nutmeg, in blender. Cover and run on high until smooth and well-blended. Sprinkle with nutmeg.",
    "category": "breakfast"
  },
  {
    "id": 9556,
    "ingredients": [
      "milk",
      "flour",
      "all-purpose flour",
      "salt",
      "cinnamon",
      "baking powder",
      "sugar",
      "granulated sugar",
      "baking soda",
      "lemon",
      "egg",
      "vegetable oil"
    ],
    "directions_list": [
      "combine",
      "soak",
      "peel"
    ],
    "directions_string": " In a medium bowl combine bran cereal and milk; let soak for 3 minutes, or until liquid is absorbed. Stir in egg and oil. In another bowl combine flour, sugar, baking powder, soda, cinnamon, lemon peel (optional) and salt. Add bran mixture, all at once, to flour mixture, stirring just until moistened; batter will be thick. Fold in peaches. Fill greased (or paper-lined) muffin cups ⅔ full. Bake at 400 °F for 20–25 minutes.",
    "category": "breakfast"
  },
  {
    "id": 9574,
    "ingredients": [
      "milk",
      "flour",
      "baking powder",
      "sweet potato",
      "sugar",
      "granulated sugar",
      "margarine",
      "butter"
    ],
    "directions_list": [
      "dough"
    ],
    "directions_string": " Preheat oven to 425 °F. Combine flour, baking powder, and sugar. Cut in margarine. Stir in mashed potatoes. Gradually add milk to form dough. Roll or pat dough to ½ inch thickness on floured board. Cut with biscuit cutter. Bake biscuits on a greased cookie sheet for 12–15 minutes.",
    "category": "breakfast"
  },
  {
    "id": 9635,
    "ingredients": [
      "apple",
      "rolled oats",
      "cinnamon",
      "water",
      "low-fat milk"
    ],
    "directions_list": [
      "stir",
      "heat",
      "simmer",
      "reduce",
      "pour",
      "boil",
      "juice"
    ],
    "directions_string": " Combine the water, apple-cherry juice blend, and apple in a saucepan. Bring to a boil over high heat, and stir in the rolled oats and cinnamon. Return to a boil, then reduce heat to low, and simmer until thick, about 3 minutes. Spoon into serving bowls, and pour milk over the servings.",
    "category": "breakfast"
  },
  {
    "id": 9644,
    "ingredients": [
      "milk",
      "salt",
      "baking powder",
      "water",
      "blue cornmeal",
      "sugar",
      "granulated sugar",
      "powdered milk",
      "margarine",
      "egg",
      "vegetable oil"
    ],
    "directions_list": [
      "mix",
      "dry"
    ],
    "directions_string": " Combine dry ingredients and stir. Add remaining ingredients and mix well Drop desired amount onto lightly greased griddle, burning once as cakes brown.",
    "category": "breakfast"
  },
  {
    "id": 9645,
    "ingredients": [
      "salt",
      "water",
      "blue cornmeal",
      "cornmeal"
    ],
    "directions_list": [
      "mix",
      "beat"
    ],
    "directions_string": " Mix cornmeal and salt. Bring water to boil. Introduce cornmeal to boiling water and mix well. Continue to beat slowly – stirring for about five minutes or until smooth and thick.",
    "category": "breakfast"
  },
  {
    "id": 9648,
    "ingredients": [
      "bacon",
      "sausage",
      "salsa",
      "egg",
      "powdered milk",
      "green onions",
      "green bell pepper",
      "ground beef",
      "pork",
      "onion",
      "milk",
      "water",
      "cheese",
      "mushroom"
    ],
    "directions_list": [
      "brown",
      "mix"
    ],
    "directions_string": " Preheat oven to 375 °F. In non-stick pan, brown bell pepper and green onions using cooking spray. Set aside. Cook sausage in skillet until crumbly. Pour out excess grease. Mix with bell peppers and onions. Prepare egg mix using 1 cup of milk and 1 cup of water; mix thoroughly. Add egg mixture to sausage mixture and mix well. Pour in 8 x 8 inch glass baking dish that has been sprayed with nonstick cooking spray. Top with grated cheese. Bake at 375 °F, turning once or twice until cooked thoroughly.",
    "category": "breakfast"
  },
  {
    "id": 9674,
    "ingredients": [
      "applesauce",
      "egg",
      "vegetable oil"
    ],
    "directions_list": [
      "top",
      "stir",
      "beat"
    ],
    "directions_string": " In a large bowl, beat eggs. Add rest of ingredients and stir until moist, but lumpy. Spoon onto hot lightly oiled grill. Flip when top surface is covered with bubbles.",
    "category": "breakfast"
  },
  {
    "id": 9721,
    "ingredients": [
      "egg",
      "cheese"
    ],
    "directions_list": [],
    "directions_string": " Grill the bread, either white or brown to the colour that you like. Whilst the toast is in the toaster put the beans in a saucepan preferably (or a microwave dish) and cook until hot.  When the toast is done put loads of butter on -never marge- and put the beans on top.  Add lots of black pepper and Daddies brown sauce on top of the dish and enjoy!",
    "category": "breakfast"
  },
  {
    "id": 9731,
    "ingredients": [
      "curry powder",
      "celery",
      "chicken broth",
      "flour",
      "salt",
      "peas",
      "pepper",
      "parsley",
      "canola oil",
      "butter",
      "onion",
      "milk",
      "puff pastry",
      "chicken",
      "carrot"
    ],
    "directions_list": [],
    "directions_string": " Grate carrot until the carrot is gone Sprinkle the grated carrot into the bowl Cut the cheese into finger slices Put the cheese into a bowl and mix it around with your hand Put the pesto into the bowl with the knife Put the bowl in the microwave for at least 15 seconds",
    "category": "dinner"
  },
  {
    "id": 9733,
    "ingredients": [
      "cinnamon sugar",
      "bread",
      "honey",
      "maple syrup",
      "butter"
    ],
    "directions_list": [
      "toast",
      "warm",
      "bread",
      "slice",
      "sprinkle",
      "pour"
    ],
    "directions_string": " Toast slice of bread until crispy and warm spread butter on toast sprinkle cinnamon sugar on toast pour maple syrup and honey on toast Enjoy!",
    "category": "breakfast"
  },
  {
    "id": 9734,
    "ingredients": [
      "black pepper",
      "salt",
      "ginger",
      "pineapple juice",
      "ketchup",
      "pork",
      "red onion",
      "vegetable oil"
    ],
    "directions_list": [],
    "directions_string": " Toast slice of bread until crispy and warm spread butter on toast sprinkle cinnamon sugar on toast pour maple syrup and honey on toast Enjoy!",
    "category": "dinner"
  },
  {
    "id": 9753,
    "ingredients": [
      "milk",
      "flour",
      "baking powder",
      "oil",
      "egg",
      "maple syrup",
      "vegetable oil"
    ],
    "directions_list": [
      "oil",
      "heat",
      "warm",
      "turn"
    ],
    "directions_string": " Sift the flour and baking powder into a mixing bowl, then use a spoon to make a well in the middle. Carefully break the egg into another bowl. Whisk it with two (2) tbsp of the oil and milk. Beat the egg mixture into the flour, a little at a time, until everything is mixed and makes a smooth batter. Pour the remaining two tablespoons of oil into a frying pan and heat it until a faint haze rises from the pan. Carefully spoon two tablespoons of batter into the pan to make one. Add batter to make two more. Cook the pancakes for a minute on one side. When they begin to bubble, turn them over with a spatula. Cook the pancakes for another minute until they puff up. Lift them out of the pan onto a warm plate.",
    "category": "breakfast"
  },
  {
    "id": 9787,
    "ingredients": [
      "milk",
      "salt",
      "mustard",
      "egg",
      "red onion",
      "mayonnaise"
    ],
    "directions_list": [
      "chop",
      "chill"
    ],
    "directions_string": " Finely chop eggs Add remaining ingredients. Mix well and chill at least three hours before serving.",
    "category": "lunch"
  },
  {
    "id": 9788,
    "ingredients": [
      "bell pepper",
      "mozzarella",
      "tomato",
      "sausage",
      "english muffin",
      "pepper",
      "oregano",
      "cheese",
      "mushroom",
      "basil",
      "onion"
    ],
    "directions_list": [
      "stir",
      "serve",
      "simmer",
      "heat",
      "slice"
    ],
    "directions_string": " Chop sausage and heat large nonstick skillet over medium-iigh heat until hot. Add sausage, mushrooms, peppers and onion and cook and stir until vegetables are tender Stir in tomatoes, oregano and basil. Reduce heat to low and simmer 25 minutes.  Preheat oven to 350 °F. Top each muffin half with ¼ cup filling and 1 slice cheese Bake just until cheese melts and serve hot.",
    "category": "brunch"
  },
  {
    "id": 9872,
    "ingredients": [
      "egg",
      "flour",
      "ham",
      "salt",
      "oil",
      "pepper",
      "sauerkraut",
      "egg yolk",
      "feta",
      "butter",
      "shallot"
    ],
    "directions_list": [
      "salt",
      "oil",
      "glaze",
      "mix",
      "dough"
    ],
    "directions_string": " Simmer the shallots with the ham in hot butter glaze and then put the mixture into a mixing bowl. The drained sauerkraut, flour, eggs, egg yolks, add feta cheese, salt and pepper and mix all ingredients well. 4 balls from the dough forms, flatten and in hot oil about 4 minutes each side until golden brown.",
    "category": "brunch"
  },
  {
    "id": 9882,
    "ingredients": [
      "filo",
      "sausage",
      "egg",
      "phyllo",
      "olive oil",
      "chile pepper",
      "feta",
      "milk"
    ],
    "directions_list": [
      "oil",
      "turn",
      "cut",
      "pour",
      "mix",
      "strain"
    ],
    "directions_string": " In a bowl mix the cheese, peppers and sausages. Lubricate a circular shape of the cake. I get a sheet of crust, strain and put in the bottom of the form. I'm not careful! I want to be wrinkled and akatastasto! Sprinkle the sheet with some olive oil and scatter a little of the filling. Continue the layers with foil, a little oil, filling up to finish materials. I conclude with foil. Beat the eggs, mix with milk and pour the souffle. With a knife, the hole here and there, to suck the liquid. Bake in preheated oven at 170 degrees for one hour until golden brown. When cooked, turn inside out and after a bit cool, cut into slices like cake!Try it and to remember! ",
    "category": "brunch"
  },
  {
    "id": 9890,
    "ingredients": [
      "olive oil",
      "garlic",
      "sage",
      "red wine vinegar"
    ],
    "directions_list": [
      "sprinkle",
      "heat",
      "cured"
    ],
    "directions_string": " Slice cured pig's cheek very thinly or ask your butcher. In a frying pan, on medium heat add 2 glugs of olive oil, garlic cloves & sage leaves, add pig's cheek. Cook for approximately 30 seconds - 1 minute on each side, until changes color to a nice golden brown, but not burned. Blot with a paper towel. Lightly sprinkle with red wine vinegar. Serve immediately with the sage.",
    "category": "breakfast"
  },
  {
    "id": 9892,
    "ingredients": [
      "parmesan cheese"
    ],
    "directions_list": [
      "brown",
      "sprinkle",
      "layer",
      "top"
    ],
    "directions_string": " In your casserole dish ladle a little of the ragu. In plenty of boiling salted water, cook your pasta until a bit further than al dente. Cook only 1 -2 sheets at a time (otherwise they will stick & it will be a mess) Lay down the sheet of pasta in your dish, ok if it comes up over the edge of the dish (that will make for the good crunch bits!) Add a ladle of ragu - cover completely but don’t over do it - less is more. Dot bechamel. Now a generous sprinkle of Parmesan cheese Repeat these steps ending with sauce on the top layer of the pasta Bake at 375 °F / 190 °C oven for 15-20 minutes until the top is brown & bubbly!",
    "category": "dinner"
  },
  {
    "id": 9898,
    "ingredients": [
      "flour",
      "salt",
      "cinnamon",
      "raisins",
      "sugar",
      "granulated sugar",
      "vegetable oil",
      "egg"
    ],
    "directions_list": [
      "oil",
      "heat"
    ],
    "directions_string": " Grate apples into a bowl. Add golden raisins, flour, egg, sugar, cinnamon and salt. Mix well. Brush a large griddle or skillet with oil and heat over moderately high heat until hot but not smoking. Drop as many tablespoons of apple mixture onto a griddle as possible to fit, leaving enough space between each one. Flatten with a spatula into ¼-inch-thick pancakes. Cook latkes for a few minutes on each side, or until golden and cooked through. Serve with a dollop of Greek Yogurt or sour cream.",
    "category": "brunch"
  },
  {
    "id": 9952,
    "ingredients": [
      "milk",
      "olive oil",
      "black pepper",
      "soy milk",
      "vanilla extract",
      "egg"
    ],
    "directions_list": [
      "flip",
      "can",
      "oil",
      "heat",
      "bread",
      "pour",
      "mix"
    ],
    "directions_string": " Crack egg into a bowl or glass Tear holes into the two slices of bread, tear and crumple the removed bread your tear out and place it into the egg in the glass Add 4 tablespoons of milk to the egg and bread Add a dash of vanilla extract to the egg and bread Beat the egg, bread, milk and vanilla until it is worked together well. Place olive oil in the skillet and place one or both slices of bread in the heated oil and pour half of the egg/bread mix into the hole of each bread slice. sprinkle/grind black pepper onto the tops. The trick here is to cook them on medium heat over a span of 20 or so minutes (usually 10 minutes per side) to crisp the bread and cook the egg thoroughly. Of course, you can cook it to your own preference. Flip once the egg in the middle has attained a stiffness allowing you to flip it. Once finished: eat it. Enjoy it. And I suggest a bit of ketchup with it.",
    "category": "breakfast"
  },
  {
    "id": 9961,
    "ingredients": [
      "garlic powder",
      "salt",
      "garlic salt",
      "bacon",
      "sugar",
      "granulated sugar",
      "egg"
    ],
    "directions_list": [
      "salt",
      "serve",
      "turn",
      "pour",
      "mix"
    ],
    "directions_string": " Carefully crack eggs and pour them into a bowl.  Mix the garlic salt or the garlic powder-salt mix (whichever you are using) with the sugar. Pour the eggs into a frying pan and turn the fire on. Before the egg whites becomes white, gently pour the powder mixture over the eggs. When done cooking, you may serve. It is suggested that you serve with bacon and toast. Enjoy!",
    "category": "breakfast"
  },
  {
    "id": 9964,
    "ingredients": [
      "spinach",
      "olive oil",
      "salt",
      "mozzarella",
      "black pepper",
      "thyme",
      "garlic",
      "basil",
      "onion"
    ],
    "directions_list": [
      "stir",
      "salt",
      "oil",
      "press",
      "turn",
      "top"
    ],
    "directions_string": " Preheat oven to 350°F (175°C). Bring the pie crust to room temperature. Heat the olive oil in a skillet over medium heat; add the onion and cook until onion becomes transparent, about 5 minutes. Combine the spinach with the onion, cover the skillet; turn off the heat, and set aside. Unroll the crust and press to fit into a 9 inch pie plate. Trim the edges. Beat the eggs in a large bowl until light colored and frothy. Add the garlic, thyme, basil, cheeses, and spinach mixture, and stir until well blended. Season to taste with salt and pepper. Pour the spinach mixture into the prepared pie crust. Bake in preheated oven until the top is golden brown, and an inserted tooth pick comes out clean, about 50 minutes.",
    "category": "brunch"
  },
  {
    "id": 9995,
    "ingredients": [
      "ham",
      "salt",
      "pepper",
      "tortillas",
      "vegetable oil"
    ],
    "directions_list": [
      "salt",
      "saute",
      "oil",
      "heat",
      "scramble",
      "sprinkle"
    ],
    "directions_string": " In a skillet heat oil and saute onions until tender then add chilies and ham and cook until heated. Beat eggs then sprinkle in salt and pepper. Pour eggs into skillet and scramble over medium heat. Warm tortillas then when eggs are cooked fill equal amounts of egg mixture in each tortilla. Roll tortillas up and tuck one end. Serve with salsa.",
    "category": "brunch"
  },
  {
    "id": 9999,
    "ingredients": [
      "parmesan cheese",
      "olive oil",
      "cauliflower",
      "onion",
      "zucchini"
    ],
    "directions_list": [
      "warm",
      "stir",
      "saute",
      "oil",
      "heat"
    ],
    "directions_string": " In a medium skillet, saute onions and zucchini in oil until tender, then add the cauliflower. In a large bowl, stir eggs, cheese and pepperoni, until blended. Pour over vegetables in skillet. Cook over low heat for 15 minutes. Take the pepperoni-filled omelet out of the pan. Serve warm and plain with rice.",
    "category": "dinner"
  },
  {
    "id": 10039,
    "ingredients": [
      "maple syrup",
      "peanut butter"
    ],
    "directions_list": [],
    "directions_string": " Place two waffles in the toaster. Warm up your maple syrup for 30 seconds. Remove the waffles from the toaster and spread peanut butter on them. Apply syrup and enjoy.",
    "category": "breakfast"
  },
  {
    "id": 10044,
    "ingredients": [
      "lime"
    ],
    "directions_list": [
      "can",
      "soak",
      "mix",
      "broil"
    ],
    "directions_string": " Place eight bamboo skewers in cold water and leave to soak for at least 10 minutes, then preheat the broiler to high. You can also stoke up a hot grill. Thread a prawn onto each skewer, then a lime wedge, then another prawn. To brush, mix the chili powder with the sweet chili sauce, if desired. Brush the sweet chili sauce over the prawns and lime wedges. Arrange the skewers on a baking sheet and broil for about 2 minutes, turning them once, until cooked through. Serve immediately with more chili sauce for dipping, as well as with the white rice, if desired.",
    "category": "dinner"
  },
  {
    "id": 10057,
    "ingredients": [
      "brown sugar",
      "salmon"
    ],
    "directions_list": [
      "bone",
      "brown",
      "trim",
      "oil",
      "skin",
      "grill",
      "dip"
    ],
    "directions_string": " Pre-heat your grill to medium high heat. Remove the pin bones with bone tweezers along the grain. Using a sharp paring or boning knife, trim bones from the cavity side of the steak. Trim the stomach flaps so that 1 side is missing about 2 inches of skin and the other, 1 inch of meat. Roll the skinless section up into the hollow of the cavity, then wrap the other around the outside to form a round resembling a filet mignon. Tie in place with 2 passes of butcher's twine. Lightly coat the sides of the salmon with mustard, then dip in brown sugar. Quickly coat the crill with canola oil to avoid sticking. Grill for 3 minutes on each side (medium rare). Serve with your favorite light side.",
    "category": "dinner"
  },
  {
    "id": 10093,
    "ingredients": [
      "red bell pepper",
      "oregano",
      "salt",
      "thyme",
      "pepper",
      "provolone",
      "sun-dried tomato",
      "olive oil",
      "basil",
      "sourdough bread",
      "butter",
      "spinach",
      "milk",
      "peppers",
      "red onion"
    ],
    "directions_list": [
      "whisk",
      "salt",
      "brown",
      "heat",
      "season",
      "bread",
      "sprinkle",
      "top",
      "cut",
      "fold",
      "layer"
    ],
    "directions_string": " Butter bread and cut into ½ inch pieces. In a sauté pan add olive oil. Add mushrooms and onions and sauté until most of the liquid has dissipated. Add spinach, remove from heat and season with salt and pepper. Mix provolone and goat cheese together in a bowl. Reserve 3 tbsps of cheese mixture. Add peppers, artichokes and olives and fold together. In a medium bowl whisk together eggs, milk, herbs, salt and pepper. In a 9 inch baking dish layer bread along the bottom and top with the cheese and vegetable mixture. Repeat each one more time and top with a sprinkle of remaining cheese. Pour egg mixture evenly over the top and sprinkle with reserved cheese mixture. Bake in the preheated oven for 30 –35 minutes or until golden brown and slightly firm.",
    "category": "brunch"
  },
  {
    "id": 10131,
    "ingredients": [
      "granny smith apple",
      "french bread",
      "light brown sugar",
      "cloves",
      "cinnamon",
      "butter",
      "milk",
      "applesauce",
      "vanilla"
    ],
    "directions_list": [
      "brown",
      "beat",
      "top",
      "bread"
    ],
    "directions_string": " In small pan cook brown sugar, butter and corn syrup until thick. Pour into ungreased rectangular baking pan. Arrange peeled apple slices on top of caramel on pan bottom. In a bowl beat eggs, milk and vanilla. Dip bread slices into the mixture for 1 minute and place bread slices on top of apples. Pour any remaining mixture over bread. Cover and refrigerate overnight. Remove from refrigerator 30 minutes before baking. Bake uncovered at 350 for 40 minutes. Combine syrup ingredients in a medium saucepan stirring frequently until hot. Serve over french toast.",
    "category": "brunch"
  },
  {
    "id": 10132,
    "ingredients": [
      "paprika",
      "black pepper",
      "egg",
      "salt",
      "rosemary",
      "green bell pepper",
      "olive oil",
      "green pepper",
      "tomato",
      "rice",
      "garlic",
      "butter",
      "onion",
      "egg yolks"
    ],
    "directions_list": [
      "simmer",
      "sprinkle",
      "heat"
    ],
    "directions_string": " Beat eggs well. Oil loaf pan well on the bottom and sides. Pour in beaten eggs then set in a pan of hot water up the sides about 2 inches. Bake at 350 for 25 minutes. Cut cooked eggs into small squares. In 10 inch skillet over medium heat add melted butter. Cook onion, pepper, garlic, salt, rosemary and paprika for 5 minutes stirring occasionally. Add tomatoes with their liquid and eggs then simmer gently covered for 10 minutes. Spoon egg mixture over rice or mashed potatoes and sprinkle on fresh grated black pepper.",
    "category": "brunch"
  },
  {
    "id": 10154,
    "ingredients": [
      "cinnamon",
      "bread",
      "granulated sugar",
      "peach",
      "cottage cheese"
    ],
    "directions_list": [
      "sprinkle"
    ],
    "directions_string": " Spread cottage cheese on the slices of toast. Place 2 wedges of peach on each and sprinkle with sugar and cinnamon. Place under a preheated broiler for 3 minutes. Serve immediately. ",
    "category": "brunch"
  },
  {
    "id": 10215,
    "ingredients": [
      "shrimp",
      "ginger",
      "green onions",
      "rice",
      "garlic",
      "vegetable oil"
    ],
    "directions_list": [],
    "directions_string": " Place all ingredients into a saucepan and bring to a boil. Lower heat and simmer into a light syrupy consistency.",
    "category": "dinner"
  },
  {
    "id": 10336,
    "ingredients": [
      "cheddar",
      "salsa"
    ],
    "directions_list": [
      "sprinkle"
    ],
    "directions_string": " Fry tortillas in small amount of oil. Fry eggs sunny side up. Place the tortillas on a plate and add the fried eggs. Pour salsa over the eggs then sprinkle with grated cheese.",
    "category": "brunch"
  },
  {
    "id": 10348,
    "ingredients": [
      "black pepper",
      "granulated sugar",
      "unsalted butter",
      "salt",
      "tomato",
      "garlic",
      "jalapeno peppers",
      "vegetable oil"
    ],
    "directions_list": [
      "oil",
      "heat",
      "fry",
      "top"
    ],
    "directions_string": " Heat vegetable oil in a heavy skillet over moderate heat and fry tortillas until limp. Drain on paper towels and place two tortillas side by side on each plate. Fry eggs in butter for 2 minutes. Place 2 eggs on top of each tortilla and top with tomato sauce. To make sauce heat oil in a saucepan and fry onion and garlic for 3 minutes. Add remaining ingredients and cook over low heat for 20 minutes stirring occasionally.",
    "category": "brunch"
  },
  {
    "id": 10356,
    "ingredients": [
      "red bell pepper",
      "cheddar",
      "black pepper",
      "bacon",
      "unsalted butter",
      "salsa",
      "salt",
      "scallions",
      "potato"
    ],
    "directions_list": [
      "top"
    ],
    "directions_string": " Melt butter in a skillet over moderate heat. Sauté potato and pepper until tender about 5 minutes. Add bacon and eggs then cook stirring frequently until set. Divide egg mixture between the tortillas and top with cheese, salsa and scallions. Roll up tucking the ends under.",
    "category": "brunch"
  },
  {
    "id": 10382,
    "ingredients": [
      "green bell pepper",
      "olive oil",
      "salt",
      "black pepper",
      "tomato",
      "red onion"
    ],
    "directions_list": [
      "salt",
      "oil",
      "simmer",
      "heat",
      "top"
    ],
    "directions_string": " Heat oil in a large skillet over high heat and sauté peppers and onion until tender. Add tomatoes and sauté 5 minutes. Season with salt and pepper and simmer until slightly thickened. Spoon vegetable mixture onto a large serving platter and top with fried eggs.",
    "category": "brunch"
  },
  {
    "id": 10392,
    "ingredients": [
      "salt",
      "black pepper",
      "caviar",
      "unsalted butter",
      "chives"
    ],
    "directions_list": [
      "salt",
      "heat",
      "season",
      "melt",
      "top",
      "boil",
      "beat"
    ],
    "directions_string": " Using an egg topper remove the top ¼ from 4 of the eggs being careful to remove only the top. Pour the yolks and whites into a small bowl and set the eggshells aside. Crack open the remaining 2 eggs and add the yolks and whites to the bowl. Using a fork beat the eggs until thoroughly blended. Bring a small saucepan three-fourths full of water to a boil over high heat. Reduce the heat to medium so the water maintains a simmer. Place one of the reserved eggshells in the simmering water for 15 seconds. Using a slotted spoon carefully remove eggshell and place upside down on paper towel to dry. Repeat with the remaining eggshells. In a nonstick sauté pan over medium heat melt the butter. Add the beaten eggs and season with salt and pepper. Stir constantly with a wooden spoon until the eggs have thickened about 5 minutes. Place the empty eggshells in egg cups. Fill the shells with the scrambled eggs dividing evenly. Garnish with the chives and a dollop of caviar. Serve immediately.",
    "category": "brunch"
  },
  {
    "id": 10395,
    "ingredients": [
      "cheddar",
      "salsa",
      "sour cream",
      "green onions",
      "tomato"
    ],
    "directions_list": [
      "cream",
      "heat",
      "scramble",
      "top",
      "cut"
    ],
    "directions_string": " Crumble turkey into large skillet and cook over medium heat until browned. Drain off any drippings then remove turkey and set aside. Add eggs to same skillet then scramble until eggs are set but not dry. Remove eggs and set aside. Place 1 tortilla in same skillet. Top with half of the eggs, cheese, turkey, onions and tomato. Heat until cheese melts then top with another tortilla. Remove from skillet and cut into six equal wedges. Repeat to make second quesadilla. Serve hot with sour cream and salsa. Refrigerate leftovers.",
    "category": "brunch"
  },
  {
    "id": 10523,
    "ingredients": [
      "flour",
      "cheddar",
      "flour",
      "white pepper",
      "worcestershire sauce",
      "white pepper",
      "dry mustard",
      "cheddar",
      "dry mustard"
    ],
    "directions_list": [
      "cool",
      "heat"
    ],
    "directions_string": "<p>Put the cheese, flour, mustard, Worcestershire sauce, butter and pepper into a saucepan. Mix well and then add the beer or milk to moisten. Be careful not to make it too wet as you'll never get it to stick to the bread. Stir the mixture over a low heat until it's melted. Once your mixture has the consistency of a thick paste, remove it from the heat and allow to cool slightly. ",
    "category": "lunch"
  },
  {
    "id": 10524,
    "ingredients": [
      "flour",
      "olive oil",
      "olive oil",
      "baking powder",
      "baking powder",
      "oregano",
      "oregano"
    ],
    "directions_list": [
      "salt",
      "knead",
      "cool",
      "mix",
      "dough"
    ],
    "directions_string": "<p>Sift the flour, baking powder and salt together. Rub in the butter and add the grated cheese. Stir in the milk and using a fork mix to a rough dough in the basin. Turn out on to a floured surface and knead lightly until smooth. Cover and rest in a cool place for l0 minutes while preparing the topping.",
    "category": "dinner"
  },
  {
    "id": 10548,
    "ingredients": [
      "popcorn",
      "strawberry",
      "cream"
    ],
    "directions_list": [],
    "directions_string": "1. Preheat the oven to 400 degrees Fahrenheit. Lightly brush the base of a 13\" x 9\" (33cm x 23cm) Swiss roll tin with vegetable oil.",
    "category": "breakfast"
  }
]